{
  "src": "https://elon-musk-interviews.com/2021/02/03/the-joe-rogan-experience-1169-elon-musk-iii-english/",
  "speakers": [
    {
      "id": "timestamp_40",
      "name": "timestamp 40"
    },
    {
      "id": "joe_rogan",
      "name": "Joe Rogan"
    },
    {
      "id": "elon_musk",
      "name": "Elon Musk"
    },
    {
      "id": "jaime",
      "name": "Jaime"
    }
  ],
  "messages": [
    {
      "role": "joe_rogan",
      "text": "Wasn’t there a Thoreau quote, that „Comparison is the thief of joy.“"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Well, “Happiness is reality minus expectations.”"
    },
    {
      "role": "joe_rogan",
      "text": "That’s great too, but the ‘comparison is the thief of joy’ really holds true to people. Is it?"
    },
    {
      "role": "jaime",
      "text": "Theodore Roosevelt."
    },
    {
      "role": "joe_rogan",
      "text": "Roosevelt, fascinating. And when you’re thinking about Instagram, because what essentially Instagram is for a lot of people is you’re giving them the opportunity to be their own PR agent, and they always go towards the glamorous, you know. And when anybody does show, you know, #nofilter, I don’t know if they really do that. Like, „Oh, you’re so brave. Look at you, no makeup,“ you know. They look good anyway.\n“You look great. What are you doing? Oh my God. You don’t have makeup on. You still look hot as fuck. You know what you’re doing. I know what you’re doing too.” They’re letting you know. And then, they’re feeding off that comment section, sort of sitting there like it’s a fresh stream of love. Like you’re getting right up to the sources as it comes out of the earth, and you’re sucking that sweet, sweet love water."
    },
    {
      "role": "elon_musk",
      "text": "A lot of emojis."
    },
    {
      "role": "joe_rogan",
      "text": "My concern is not so much what Instagram is. It’s that I didn’t think that people had the need for this or the expectation for some sort of technology that allows them to constantly get love and adulation from strangers, and comments, and this ability to project this sort of distorted version of who you really are.\nBut I worry about where it goes. Like, what’s the next one? What’s the next one? Like, where is it? Is it going to be augmented to some sort of a weird augmented or virtual sort of Instagram type situation where you’re not going to want to live in this real world, you’re going to want to interface with this sort of world that you’ve created through your social media page and some next-level thing."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Go live in the simulation."
    },
    {
      "role": "joe_rogan",
      "text": "Some ‘\nReady Player One\n’ type shit that’s real. That seems — we have that\nHTC Vive\nhere. I’ve only done it a couple of times, quite honestly, because it kind of freaks me out."
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "My kids fucking love it, man. They love it. They love playing these weirdo games and walking around that headset on. But part of me watching them do it goes, „Wow, I wonder if this is like the precursor.“ Just sort of like if you look at that phone that Gordon Gekko had on the beach, and you compare that-"
    },
    {
      "role": "elon_musk",
      "text": "Yes, the big cell phone."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, you compare that to like a Galaxy Note 9."
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "Like, how the fuck did that become that, right? And I wonder when I see this HTC Vive, I’m like, „What is that thing going to be ten years from now when we’re making fun of what it is now?“ I mean, how ingrained, and how connected and interconnected is this technology going to be in our life?"
    },
    {
      "role": "elon_musk",
      "text": "It will be, at some point, indistinguishable from reality."
    },
    {
      "role": "joe_rogan",
      "text": "We will lose this. We’ll lose this. Like you and I are just looking at each other through our eyes."
    },
    {
      "role": "elon_musk",
      "text": "Are we?"
    },
    {
      "role": "joe_rogan",
      "text": "I see you. You see me, I think, I hope."
    },
    {
      "role": "elon_musk",
      "text": "You think so?"
    },
    {
      "role": "joe_rogan",
      "text": "I think you probably have regular eyes."
    },
    {
      "role": "elon_musk",
      "text": "This could be some simulation."
    },
    {
      "role": "joe_rogan",
      "text": "It could. Do you entertain that?"
    },
    {
      "role": "elon_musk",
      "text": "Well, the argument for the simulation, I think, is quite strong because if you assume any improvements at all over time, any improvement, 1%, 0.1%, just extend the time frame, make it a thousand years, a million years. The universe is 13.8 billion years old. Civilization, if you count it, if you’re very generous, civilization is maybe 7000 or 8000 years old if you count it from the first writing. This is nothing. This is nothing.\nSo, if you assume any rate of improvement at all, then games will be indistinguishable from reality, or civilization will end. One of those two things will occur. Therefore, we are most likely in a simulation. Because we exist."
    },
    {
      "role": "joe_rogan",
      "text": "Or we’re on our way to one, right? Well, not just because we exist. We could most certainly be on the road. We could be on the road to that, right. It doesn’t mean that it has to have already happened."
    },
    {
      "role": "elon_musk",
      "text": "We could be in ‘Base Reality’."
    },
    {
      "role": "joe_rogan",
      "text": "We could be here now on our way to the road or on our way to the destination where this can never happen again;  where we are completely ingrained in some sort of an artificial technology or some sort of a symbiotic relationship with the internet or the next level of sharing information. But, right now, we’re not there yet. That’s possible too, right? It’s possible that a simulation is, one day, going to be inevitable, that we’re going to have something that’s indistinguishable from regular reality, but maybe we’re not there yet. That’s also possible."
    },
    {
      "role": "elon_musk",
      "text": "Yes, it is."
    },
    {
      "role": "joe_rogan",
      "text": "So, we’re not quite there yet. This is real? When I touch that wood?"
    },
    {
      "role": "elon_musk",
      "text": "It feels very real."
    },
    {
      "role": "joe_rogan",
      "text": "Maybe that’s why everybody is like into like Mason jars and shit. Suede shoes. People are going to, like, craft restaurants, and they want raw wood. Everyone wants to see metal. It seems, people are like longing towards some weird log cabin type nostalgia."
    },
    {
      "role": "elon_musk",
      "text": "Sure, reality."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, like holding on. Like clinging."
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "Just dragging their nails through the mud like, „Don’t take me yet.“"
    },
    {
      "role": "elon_musk",
      "text": "Yes. But then, people go get a mason jar with a wine stem or a handle. That’s dark. Makes me lose faith in humanity."
    },
    {
      "role": "joe_rogan",
      "text": "Mason jar, wine stem and a handle, they have those?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Oh, those dirty people. That’s just assholes. That’s like people make pet rocks."
    },
    {
      "role": "elon_musk",
      "text": "Rough."
    },
    {
      "role": "joe_rogan",
      "text": "Right. Some people are just assholes. They take advantage of our generous nature."
    },
    {
      "role": "elon_musk",
      "text": "It was made with a wine stem. Made with a handle."
    },
    {
      "role": "joe_rogan",
      "text": "They made it that way?"
    },
    {
      "role": "elon_musk",
      "text": "Yes. They’re manufactured like that."
    },
    {
      "role": "joe_rogan",
      "text": "So, the one way, they welded it on to the mason jar. You fuck."
    },
    {
      "role": "elon_musk",
      "text": "That would be fine if there was like glued it on or something. But it was made that way."
    },
    {
      "role": "joe_rogan",
      "text": "Like trash chic. Oh, this is disgusting. Look at this. It is right there. (\nshows pictures\n)"
    },
    {
      "role": "elon_musk",
      "text": "Yes, it’s pretty harsh. Yup."
    },
    {
      "role": "joe_rogan",
      "text": "This is terrible. Yeah. That’s like fake breasts that are designed to be hard. Like fake breasts from the ’60s. It’s like if you really long for the ones with ripples, here we go. Yeah. That’s almost what that is."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "What are you going to do, man? There’s nothing, you know. There’s nothing you can do to stop certain terrible ideas from propagating."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Anyway, I don’t want to sound like things are too dark because I think you kind of have to be optimistic about the future. There’s no point in being pessimistic. It’s just too negative because it is-"
    },
    {
      "role": "joe_rogan",
      "text": "It doesn’t help."
    },
    {
      "role": "elon_musk",
      "text": "It doesn’t help, you know. I think you want to be — I mean, my theory is like you’d rather be optimistic. I think I’d rather be optimistic and wrong than pessimistic and right."
    },
    {
      "role": "joe_rogan",
      "text": "Right."
    },
    {
      "role": "elon_musk",
      "text": "At least, or on that side."
    },
    {
      "role": "joe_rogan",
      "text": "Right, yeah."
    },
    {
      "role": "elon_musk",
      "text": "Because if you’re pessimistic, it’s going to be miserable."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. Yeah, nobody wants to be around you anyway if it’s the end of the world. You’re like, „I fucking told you, bro.“"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, exactly."
    },
    {
      "role": "joe_rogan",
      "text": "The world is ending. Yeah. It is what it is for all."
    },
    {
      "role": "elon_musk",
      "text": "Enjoy the journey."
    },
    {
      "role": "joe_rogan",
      "text": "Right. If you really want to get morose, I mean, it is what it is for all of us anyway. We’re all going to go unless something changes."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I mean, ultimately, you know, even if we just sort of existed as humans forever, we’d still eventually be like the heat death of the universe a zillion years from now."
    },
    {
      "role": "joe_rogan",
      "text": "Right, even if we get it past the sun."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "If we figure out a way past the sun running out of juice."
    },
    {
      "role": "elon_musk",
      "text": "Eventually, it’s going to end. It’s just a question of when."
    },
    {
      "role": "joe_rogan",
      "text": "Right."
    },
    {
      "role": "elon_musk",
      "text": "So, it really is all about the journey."
    },
    {
      "role": "joe_rogan",
      "text": "Or transcendence from whatever we are now into something that doesn’t worry about death."
    },
    {
      "role": "elon_musk",
      "text": "The universe, as we know it, will dissipate into a fine mist of cold nothingness eventually."
    },
    {
      "role": "joe_rogan",
      "text": "And then, someone’s going to bottle it and put a fragrance to it, sell it to French people in another dimension."
    },
    {
      "role": "elon_musk",
      "text": "It’s just a very long time."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah."
    },
    {
      "role": "elon_musk",
      "text": "So, I think it’s really just about, how can we make it last longer."
    },
    {
      "role": "joe_rogan",
      "text": "Are you a proponent of the multi-universe theory? Do you believe that there are many, many universes, and that even if this one fades out that there are other ones that are starting fresh right now, and there’s an infinite number of them, and they’re just constantly in a never-ending cycle of birth and death?"
    },
    {
      "role": "elon_musk",
      "text": "I think most likely. This is just about probability. There are many, many simulations. These simulations, we might as well call them reality, or we could call them the multiverse."
    },
    {
      "role": "joe_rogan",
      "text": "These simulations, you believe are created, like, someone has manufactured-"
    },
    {
      "role": "elon_musk",
      "text": "They’re running on the substrate."
    },
    {
      "role": "joe_rogan",
      "text": "So-"
    },
    {
      "role": "elon_musk",
      "text": "That substrate is probably boring."
    },
    {
      "role": "joe_rogan",
      "text": "Boring?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "How so?"
    },
    {
      "role": "elon_musk",
      "text": "Well, when we create a simulation like a game or a movie, it’s the distillation of what’s interesting about life. You know, it takes a year to shoot an action movie. And then, that’s all to slow down into two or three hours. So, let me tell you, if you see an action movie being filmed, it’s boring. It’s super boring.\nThere’s like lots of takes. Everything’s on a green screen.  It looks pretty goofy. It doesn’t look cool. But once you had the CGI and have great editing, it’s amazing. So, I think, most likely, if we’re in a simulation, it’s really boring outside the simulation. Because why would you make a simulation that’s boring? You’d make simulation way more interesting than base reality."
    },
    {
      "role": "joe_rogan",
      "text": "That is if this right now is a simulation."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "And, ultimately, inevitably, as long as we don’t die or get hit by a meteor, we’re going to create some sort of simulation if we continue on the same technological path we’re on right now."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "But we might not be there yet. So, it might not be a simulation here. But it most likely is you feel other places."
    },
    {
      "role": "elon_musk",
      "text": "This notion of a place or where is-"
    },
    {
      "role": "joe_rogan",
      "text": "Flawed?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Flawed perception."
    },
    {
      "role": "elon_musk",
      "text": "Like that, if you have that, sort of, that Vive you have, that’s made by\nValve\n, and it’s really Valve that made it. HTC did the hardware, but it’s really a Valve thing."
    },
    {
      "role": "joe_rogan",
      "text": "Makers of\nHalf-Life\n."
    },
    {
      "role": "elon_musk",
      "text": "Yes. Valve. Great company."
    },
    {
      "role": "joe_rogan",
      "text": "Great company."
    },
    {
      "role": "elon_musk",
      "text": "When you’re in that virtual reality, which is only going to get better, where are you? Where are you really?"
    },
    {
      "role": "joe_rogan",
      "text": "Right."
    },
    {
      "role": "elon_musk",
      "text": "You aren’t anywhere."
    },
    {
      "role": "joe_rogan",
      "text": "Well, whereas-"
    },
    {
      "role": "elon_musk",
      "text": "You’re in the computer."
    },
    {
      "role": "joe_rogan",
      "text": "You know, what defines where you are?"
    },
    {
      "role": "elon_musk",
      "text": "Exactly."
    },
    {
      "role": "joe_rogan",
      "text": "Right."
    },
    {
      "role": "elon_musk",
      "text": "It’s your perception."
    },
    {
      "role": "joe_rogan",
      "text": "Is it your perceptions or is it, you know, a scale that we have under your butt. You’re right here. I’ve measured you. You’re the same weight as you were when you left. But meanwhile, your experience is probably different-"
    },
    {
      "role": "elon_musk",
      "text": "Why do you think you’re where you are right now? You might not be."
    },
    {
      "role": "joe_rogan",
      "text": "I’ll spark up a joint if you keep talking. Your manager is going to come in here. We might have to lock the door."
    },
    {
      "role": "elon_musk",
      "text": "Right now, you think you’re in a studio in LA."
    },
    {
      "role": "joe_rogan",
      "text": "That’s what I heard."
    },
    {
      "role": "elon_musk",
      "text": "You might be in a computer."
    },
    {
      "role": "joe_rogan",
      "text": "Oh listen, man, I think about this all the time. Yeah, I mean, it’s unquestionable that one day that will be the case, as long as we keep going, as long as nothing interrupts us, and if we start from scratch, and, you know, we’re single-celled organisms all over again. And then, millions and millions of years later, we become the next thing that is us with creativity and the ability to change its environment.\nIt’s going to keep monkeying with things until it figures out a way to change reality. To change — I mean, almost like punch a hole through what is this thing into what it wants it to be and create new things. And then, those new things will intersect with other people’s new things, and there will be this ultimate pathway of infinite ideas and expression all through technology."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "And then, we’re going to wonder like, „Why are we here? What are we doing?“"
    },
    {
      "role": "elon_musk",
      "text": "Let’s find out."
    },
    {
      "role": "joe_rogan",
      "text": "Well-"
    },
    {
      "role": "elon_musk",
      "text": "I mean, I think we should take the actions, the set of actions that are most likely to make the future better."
    },
    {
      "role": "joe_rogan",
      "text": "Yes, right."
    },
    {
      "role": "elon_musk",
      "text": "And then, we evaluate those actions to make sure that it’s true."
    },
    {
      "role": "joe_rogan",
      "text": "Well, I think there’s a movement to that. I mean, in terms of like a social movement. I think some of it’s misguided, and some of it’s exaggerated, and there’s a lot of people that are fighting for their side out there. But it seems like the general trend of, like, social awareness seems to be much more heightened now than has ever been in any other time in history because of our ability to express ourselves instantaneously to each other through Facebook, or Twitter, or what have you. And that the trend is to abandon preconceived notions, abandon prejudice, abandon discrimination, and promote kindness and happiness as much as possible. Looking at this knife? Somebody gave it to me. Sorry."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. What is it?"
    },
    {
      "role": "joe_rogan",
      "text": "My friend Donnie, he brought this with him, and it just stayed here. I have a real samurai sword if you want to play with that. I know you’re into weapons. That’s from the 1500s. The samurai sword at the end of the table."
    },
    {
      "role": "elon_musk",
      "text": "Really?"
    },
    {
      "role": "joe_rogan",
      "text": "Yeah."
    },
    {
      "role": "elon_musk",
      "text": "That’s cool."
    },
    {
      "role": "joe_rogan",
      "text": "I’ll grab it. Hold on. (\npasses Elon the sword\n) Yeah, that’s a legit samurai sword from an actual samurai from the 1500s. If you pull out that blade, that blade was made the old way where a master craftsman…"
    },
    {
      "role": "elon_musk",
      "text": "Folded metal?"
    },
    {
      "role": "joe_rogan",
      "text": "…folded that metal and hammered it down over and over again over a long period of time, and honed that blade into what it is now. What’s crazy is that more than 500 years later, that thing is still pristine. I mean, whoever took care of that and passed it down to the next person who took care of it,  and you know until it got to the podcast room, it’s pretty fucking crazy."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "One day, someone’s going to be looking at a Tesla like that. Yeah, these fucking backdoors, they pop up sideways like a Lamborghini."
    },
    {
      "role": "elon_musk",
      "text": "You should see what a Tesla can do. You didn’t. You should. I’ll show you afterwards."
    },
    {
      "role": "joe_rogan",
      "text": "Well, I’ve driven one. I love them."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, but most people don’t know what it can do."
    },
    {
      "role": "joe_rogan",
      "text": "In terms of, like, ludicrous mode? In terms of, like, driving super fast and irresponsibly on public roads, is that what you’re saying?"
    },
    {
      "role": "elon_musk",
      "text": "Well, any car can do that."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. What can it do that I need to know about?"
    },
    {
      "role": "elon_musk",
      "text": "I mean, the Model X can do this\nballet thing to the Trans-Siberian Orchestra\n. It’s pretty cool."
    },
    {
      "role": "joe_rogan",
      "text": "Wait, it dances?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Legitimate, like it goes around?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Why would you program that into a car?"
    },
    {
      "role": "elon_musk",
      "text": "It seemed like fun."
    },
    {
      "role": "joe_rogan",
      "text": "That’s what I get about you. That’s what’s weird. Like when you showed up here, you were all smiles, and you pull out a fucking blowtorch or ‘not a blowtorch’, but I’m like, „Look at this dude“…"
    },
    {
      "role": "elon_musk",
      "text": "Not a flamethrower."
    },
    {
      "role": "joe_rogan",
      "text": "Not a flamethrower. Like, „He’s having fun.“"
    },
    {
      "role": "elon_musk",
      "text": "I want to be clear, it’s definitely not a flamethrower."
    },
    {
      "role": "joe_rogan",
      "text": "But you’re having fun. Like this thing, you know, you program a car to do a ballet dance, you’re having fun."
    },
    {
      "role": "elon_musk",
      "text": "It’s great."
    },
    {
      "role": "joe_rogan",
      "text": "But how do you have the time to do that? I don’t understand. While you’re digging holes under the earth, and sending rockets into space, and powering people in Australia, like, how the fuck do you have time to make the car dance ballet?"
    },
    {
      "role": "elon_musk",
      "text": "Well, I mean, in that case, there were some engineers at Tesla that said, „You know, what if we make this car dance and play music?“ I was like, „That sounds great. Please do it. Let’s try to get it done in time for Christmas.“ We did."
    },
    {
      "role": "joe_rogan",
      "text": "Is there a concern about someone just losing their mind and making it do that on the highway?"
    },
    {
      "role": "elon_musk",
      "text": "No, it won’t do that."
    },
    {
      "role": "joe_rogan",
      "text": "What if it’s in bumper-to-bumper traffic?"
    },
    {
      "role": "elon_musk",
      "text": "Nope."
    },
    {
      "role": "joe_rogan",
      "text": "No, it won’t do it?"
    },
    {
      "role": "elon_musk",
      "text": "No. Actually, you have to…- it’s an Easter egg."
    },
    {
      "role": "joe_rogan",
      "text": "Oh, it’s an Easter egg."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, that’s why people don’t know about it. Including people that have the car. It’s like it can do lots of things, lots of things."
    },
    {
      "role": "joe_rogan",
      "text": "Once Reddit gets a hold of it, everyone’s going to know already."
    },
    {
      "role": "elon_musk",
      "text": "You just have to – Everyone — if you search for it on the internet, you will find out. But people don’t know that they should even search for it."
    },
    {
      "role": "joe_rogan",
      "text": "Well, they do now."
    },
    {
      "role": "elon_musk",
      "text": "Yes. There’s so many things about the Model X, and the Model S, and the Model 3 that people don’t know about.  We should probably do a video or something to explain it because I have close friends of mine, and I say, „Do you know the car can do this?“ and they’re like, „Nope.“"
    },
    {
      "role": "joe_rogan",
      "text": "Do you want to do a video of that? Do you like the fact that some people don’t know?"
    },
    {
      "role": "elon_musk",
      "text": "No, I think it’s probably not. We should tell people."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, probably."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "That would help your product. I mean, it’s not like you don’t sell enough of them. You sell almost too many of them, right."
    },
    {
      "role": "elon_musk",
      "text": "I mean, I think a Tesla is the most fun thing you could possibly buy ever. That’s what it’s meant to be. Our goal is to make — It’s not exactly a car. It’s actually a thing to maximize enjoyment, make as maximum fun."
    },
    {
      "role": "joe_rogan",
      "text": "Okay. Electronic, like big screen, laptop, ridiculous speed, handling, all that stuff."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. And we’re going to put video games in it."
    },
    {
      "role": "joe_rogan",
      "text": "You are?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Is that wise? What kind of video games? Candy Crush?"
    },
    {
      "role": "elon_musk",
      "text": "You won’t be able to drive while you’re playing the video game. But, like, for example, we’re just putting the Atari emulator in it. So, we’ll play a Missile Command, and Lunar Lander, and a bunch of other things. Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "That sounds cool."
    },
    {
      "role": "elon_musk",
      "text": "It’s pretty fun."
    },
    {
      "role": "joe_rogan",
      "text": "I like that."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I mean, we improved the interface for Missile Command because it’s too hard with the old trackball. So, this is a touch screen version of Missile Command. So, you have a chance."
    },
    {
      "role": "joe_rogan",
      "text": "Do you — You have an old car, don’t you? Don’t you have an old Jaguar?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. How do you know that? I have a ’61 series 1 E-Type Jaguar."
    },
    {
      "role": "joe_rogan",
      "text": "I love cars."
    },
    {
      "role": "elon_musk",
      "text": "It’s great."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, I love old cars."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, the only two gasoline cars I have are that and an old — like a Ford Model T that a friend of mine gave me. Those are my only two gasoline cars."
    },
    {
      "role": "joe_rogan",
      "text": "Is the Ford Model T all stocked? Oh, there’s your car. Look at that. (\nshows picture\n)"
    },
    {
      "role": "elon_musk",
      "text": "I have the convertible with a…"
    },
    {
      "role": "joe_rogan",
      "text": "That is a gorgeous car."
    },
    {
      "role": "elon_musk",
      "text": "…soft top."
    },
    {
      "role": "joe_rogan",
      "text": "God, that’s a good looking car."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Is that yours? (\nshows more pictures\n)"
    },
    {
      "role": "elon_musk",
      "text": "That is — It’s not mine. It’s extremely close to mine, but I don’t have a front license plate on mine."
    },
    {
      "role": "joe_rogan",
      "text": "It’s a beautiful car. They nailed it. That new type-"
    },
    {
      "role": "elon_musk",
      "text": "Mine looks like that."
    },
    {
      "role": "joe_rogan",
      "text": "God, they nailed that."
    },
    {
      "role": "elon_musk",
      "text": "That’s what mine looks like. Maybe it is mine."
    },
    {
      "role": "joe_rogan",
      "text": "There’s certain iconic shapes."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "And there’s something about those cars, too. They’re not as capable, not nearly as capable as a Tesla, but there’s something really satisfying about the mechanical aspect of like feeling the steering and the grinding of the gears and the shifting. There’s something about those that’s extremely satisfying even though they’re not that competent. Like I have a 1993 Porsche 964. It’s like a lightweight. It’s not an RS America. It’s not very fast. It’s not like in comparison to a Tesla or anything like that. But the thing about it is like it’s mechanical, you feel it."
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "It’s like, it gives you this weird thrill like you’re on this clunky ride, and there’s all this feedback. There’s something to that."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Yeah, absolutely. I mean, yeah. My E-Type is like basically no electronics."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. So, you like that, but you also like electronics."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Like your Teslas, it’s like the far end of electronics."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "It drives itself."
    },
    {
      "role": "elon_musk",
      "text": "It’s driving itself better every day. We’re about to release the software that will enable you to just turn it on, and it’ll drive from highway on-ramp to highway exit, do lane changes, overtake other cars-"
    },
    {
      "role": "joe_rogan",
      "text": "Jesus."
    },
    {
      "role": "elon_musk",
      "text": "To go from one interchange to the next. If you get on, say, the 405, get off 300 miles later, and go through several highway interchanges, and just overtake other cars, and hook into the nav system, and then-."
    },
    {
      "role": "joe_rogan",
      "text": "And you’re just meditating, om."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "While your car is just traveling."
    },
    {
      "role": "elon_musk",
      "text": "It’s kind of eerie. It’s kind of eerie."
    },
    {
      "role": "joe_rogan",
      "text": "What did you think when you saw that video of that dude fallen asleep behind the wheel? I’m sure you’ve seen it, the one in San Francisco. It’s like right outside of San Jose, the dude’s out cold, like this. And the car’s an inch bumper-to-bumper in traffic moving along. You’ve seen it, right?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. We changed the software. That’s, I think, an old video. We changed software. If you don’t touch the wheel, it will gradually slow down, and put the emergency lights on, and wake you up."
    },
    {
      "role": "joe_rogan",
      "text": "Oh, that’s hilarious."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Can you choose what voice wakes you up?"
    },
    {
      "role": "elon_musk",
      "text": "Well, it’s sort of more of a — It sort of honks."
    },
    {
      "role": "joe_rogan",
      "text": "It honks?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "There should be like, „Wake up, fuckface. You’re endangering your fellow humans.“"
    },
    {
      "role": "elon_musk",
      "text": "We could gently wake you up with a  sultry voice."
    },
    {
      "role": "joe_rogan",
      "text": "That would be good, like, something with a southern accent. „Hey, wake up.“"
    },
    {
      "role": "elon_musk",
      "text": "Wake up, sunshine."
    },
    {
      "role": "joe_rogan",
      "text": "Hey, sweetie."
    },
    {
      "role": "elon_musk",
      "text": "Exactly."
    },
    {
      "role": "joe_rogan",
      "text": "Why don’t you wake up?"
    },
    {
      "role": "elon_musk",
      "text": "You could pick whatever you want. Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, I choose the Australian girl from Siri. I like her voice."
    },
    {
      "role": "elon_musk",
      "text": "Do you want it seductive?"
    },
    {
      "role": "joe_rogan",
      "text": "It’s my favorite. I like Australian."
    },
    {
      "role": "elon_musk",
      "text": "What flavor? Do what you want it to be angry. It could be anything."
    },
    {
      "role": "joe_rogan",
      "text": "You want those Australian prison lady genes. Now, when you program something like that, is this in response to a concern, or is it your own… Do look at it and go, „Hey, they shouldn’t just be able to fall asleep. Let’s wake them up.“"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, it’s like — You know, people are falling asleep. We better do something about that."
    },
    {
      "role": "joe_rogan",
      "text": "Right. But when you first released it, you didn’t consider it, right? You’re just like, „Well, no one’s going to just sleep.“"
    },
    {
      "role": "elon_musk",
      "text": "People fall asleep in their cars all the time. They crash."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, it’s horrible."
    },
    {
      "role": "elon_musk",
      "text": "At least our car doesn’t crash. That’s better. It’s better not to crash. Imagine if that guy had fallen asleep in a gasoline car. They do it all the time."
    },
    {
      "role": "joe_rogan",
      "text": "For sure, yeah."
    },
    {
      "role": "elon_musk",
      "text": "They would crash into somebody."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah."
    },
    {
      "role": "elon_musk",
      "text": "And, in fact, the thing that really, you know, got me to — It’s like, „Man, we better get autopilot going and get it out there.“ A guy was in an early Tesla driving down the highway, and he fell asleep, and he ran over a cyclist and killed him. I was like, „Man, if we had autopilot, he might have fallen asleep, but, at least, he wouldn’t run over that cyclist.“"
    },
    {
      "role": "joe_rogan",
      "text": "So, how did you implement it? Did you just use cameras and programmed the system so that if it sees images, it slows down?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Is the person who’s in control of it allowed to program how fast it goes?"
    },
    {
      "role": "elon_musk",
      "text": "Yes. You can program it to be more or less, like more conservative or like more aggressive driver. And you can say what speed you want it to — What speed is okay."
    },
    {
      "role": "joe_rogan",
      "text": "I know you have ludicrous mode. Do you have douchebag mode? It just cuts people off."
    },
    {
      "role": "elon_musk",
      "text": "Well, for lane changes, it’s tricky because if you’re in like LA, like unless you’re pretty aggressive, right, it’s hard to change lanes sometimes."
    },
    {
      "role": "joe_rogan",
      "text": "You can’t. It’s hard to be ‘sat nam’. It’s hard to be ‘namaste’ out here in LA. If you want to hit that Santa Monica Boulevard off-ramp…"
    },
    {
      "role": "elon_musk",
      "text": "I mean, you’ve got to be a little pushy on the freeway."
    },
    {
      "role": "joe_rogan",
      "text": "You’ve got to be a little pushy, yeah, especially when people are angry. If they’re a little angry, they don’t want to let you in; they speed up."
    },
    {
      "role": "elon_musk",
      "text": "Sometimes, I think, people overall are pretty nice on the highway, even in LA, but sometimes they’re not."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think the Neuralink will help that?"
    },
    {
      "role": "elon_musk",
      "text": "Probably."
    },
    {
      "role": "joe_rogan",
      "text": "Everybody will be locked in together in this hive mind."
    },
    {
      "role": "elon_musk",
      "text": "Tunnels will help it."
    },
    {
      "role": "joe_rogan",
      "text": "That will help a lot."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "How many of those can you put in there?"
    },
    {
      "role": "elon_musk",
      "text": "Nice thing about tunnels is you can go 3D. So, you can go many levels."
    },
    {
      "role": "joe_rogan",
      "text": "Until you hit hell."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, but you can go — You can have 100 levels of tunnel. No problems."
    },
    {
      "role": "joe_rogan",
      "text": "Jesus Christ. I don’t want to be on 99. That would be a negative 99 floors."
    },
    {
      "role": "elon_musk",
      "text": "This is one of the fundamental things people don’t appreciate about tunnels is that it’s not like roads. The fundamental issue with roads is that you have a 2D transport system and a 3D living and workspace environment. So, you’ve got all these tall buildings or concentrated work environments. And then, you want to go into those like 2D transport system with…"
    },
    {
      "role": "joe_rogan",
      "text": "Hugely inefficient."
    },
    {
      "role": "elon_musk",
      "text": "… pretty low density because cars are spaced out pretty far. And so, that, obviously, is not going to work. You’re going to have traffic guaranteed. But if you can go 3D on your transport system, then you can solve all traffic. And you can either go 3D up with a flying car, or you can go 3D down with tunnels. You can have as many tunnel levels as you want, and you can arbitrarily relieve any amount of traffic. You can go further down with tunnels than you can go up with buildings. You’re 10,000 feet down if you want. I wouldn’t recommend it, but…"
    },
    {
      "role": "joe_rogan",
      "text": "What was that movie with — What’s his face? Bradley — Not Bradley Cooper, Christian? No. What the fuck is his name? Batman. Who is Batman?"
    },
    {
      "role": "jaime",
      "text": "Christian Bale."
    },
    {
      "role": "joe_rogan",
      "text": "Christian Bale, where they fought dragons. Him and Matthew McConaughey. He went down deep into the earth. How deep can you go?"
    },
    {
      "role": "elon_musk",
      "text": "I don’t think that was Batman."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, it was. Yeah, it was."
    },
    {
      "role": "elon_musk",
      "text": "Batman fought dragons? I don’t-"
    },
    {
      "role": "joe_rogan",
      "text": "No, it wasn’t Batman, but it’s Christian Bale."
    },
    {
      "role": "jaime",
      "text": "‘\nReign of Fire\n’."
    },
    {
      "role": "elon_musk",
      "text": "Okay."
    },
    {
      "role": "joe_rogan",
      "text": "Never saw that?"
    },
    {
      "role": "elon_musk",
      "text": "No."
    },
    {
      "role": "joe_rogan",
      "text": "Terrible. Terrible, but good. I would look at it some time."
    },
    {
      "role": "elon_musk",
      "text": "I wouldn’t recommend drilling super far down, but the Earth is a big…"
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, but you can’t drill deep. It gets hot, right?"
    },
    {
      "role": "elon_musk",
      "text": "Earth is a giant ball of lava with a thin crust on the top, which we think of as like the surface,  this thin crust. And it’s mostly just a big bowl of lava. That’s Earth, but 10,000 feet is not a big deal."
    },
    {
      "role": "joe_rogan",
      "text": "Have you given any consideration whatsoever to the Flat Earth movement?"
    },
    {
      "role": "elon_musk",
      "text": "I think that’s a troll situation."
    },
    {
      "role": "joe_rogan",
      "text": "Oh, it’s not. No, it’s not. You would like to think that…"
    },
    {
      "role": "elon_musk",
      "text": "Okay."
    },
    {
      "role": "joe_rogan",
      "text": "… because you’re a super genius. But I, as a normal person, I know there’s people  way dumber than me. And they really, really believe. They watch YouTube videos, which go on uninterrupted, and spew out a bunch of fucking fake facts very eloquently and articulately. And they really believe. These people really believe."
    },
    {
      "role": "elon_musk",
      "text": "I mean, if it works for them, sure. Fine."
    },
    {
      "role": "joe_rogan",
      "text": "It’s weird though, right, that in this age where, you know, there’s ludicrous mode in your car, goes 1.9 seconds, 0 to 60."
    },
    {
      "role": "elon_musk",
      "text": "That’s 2.2."
    },
    {
      "role": "joe_rogan",
      "text": "2.2. Which one’s 1.9? The Roadster?"
    },
    {
      "role": "elon_musk",
      "text": "The next-generation Roadster. Standard edition."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, I’m on top of this shit. Standard edition."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. So, it’s without the performance package."
    },
    {
      "role": "joe_rogan",
      "text": "What performance package? What the fuck do you need?"
    },
    {
      "role": "elon_musk",
      "text": "We put rocket thrusters on it."
    },
    {
      "role": "joe_rogan",
      "text": "For real?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "What are they going to burn?"
    },
    {
      "role": "elon_musk",
      "text": "Nothing. Ultrahigh pressure compressed air."
    },
    {
      "role": "joe_rogan",
      "text": "Whoa. Just air?"
    },
    {
      "role": "elon_musk",
      "text": "Just cold gas thrusters."
    },
    {
      "role": "joe_rogan",
      "text": "Then, do you do to have the air tanks or they’re sucking air out of…?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. It has an electric pump."
    },
    {
      "role": "joe_rogan",
      "text": "Whoa."
    },
    {
      "role": "elon_musk",
      "text": "Pump it up like 10,000 psi."
    },
    {
      "role": "joe_rogan",
      "text": "And how fast are we talking? Zero to 60."
    },
    {
      "role": "elon_musk",
      "text": "How fast you want to go?"
    },
    {
      "role": "joe_rogan",
      "text": "I want to go-"
    },
    {
      "role": "elon_musk",
      "text": "We could make this thing fly."
    },
    {
      "role": "joe_rogan",
      "text": "I want to go back in time."
    },
    {
      "role": "elon_musk",
      "text": "I can make it fly."
    },
    {
      "role": "joe_rogan",
      "text": "You make it fly?"
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "Do you anticipate that as being — I mean, you’re talking about the tunnels and then flying cars. Do you really think that’s going to be real?"
    },
    {
      "role": "elon_musk",
      "text": "Too noisy, and there’s too much airflow. So, the final issue with flying cars — I mean, if you get like one of those like toy drones, think of how loud those are and how much air they blow. Now, imagine if that’s like a thousand times heavier. This is not going to make your neighbors happy. Your neighbors are not going to be happy if you land a flying car in your backyard."
    },
    {
      "role": "joe_rogan",
      "text": "It will be very helicopter-like."
    },
    {
      "role": "elon_musk",
      "text": "Or on your roof. It’s just really going to be like, „What the hell. That was annoying.“ Like, if you want a flying car, just put some wheels on a helicopter."
    },
    {
      "role": "joe_rogan",
      "text": "Is there a way around that? Like what if they  figure out some sort of magnetic technology, like all those Bob Lazar type characters who were thinking that was a part of the UFO technology they were doing at Area 51? Remember, didn’t they have some thoughts about magnetics?"
    },
    {
      "role": "elon_musk",
      "text": "Nope."
    },
    {
      "role": "joe_rogan",
      "text": "No? Bullshit?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Really?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. There’s a fundamental momentum exchange with the air. So, you must accelerate. You have a mass, and you have gravitational acceleration. Your mass times gravity must equal the mass of airflow times acceleration of that airflow to have a neutral force. MG=MA. And then you won’t move. If MG is greater than MA, you will go down. And if MA is greater than MG, you will go up. That’s how it works."
    },
    {
      "role": "joe_rogan",
      "text": "There’s just no way around that?"
    },
    {
      "role": "elon_musk",
      "text": "There is definitely no way around it."
    }
  ]
}