{
  "src": "https://elon-musk-interviews.com/2021/03/17/the-joe-rogan-experience-1470-elon-musk-ii-english/",
  "speakers": [
    {
      "id": "joe_rogan",
      "name": "Joe Rogan"
    },
    {
      "id": "elon_musk",
      "name": "Elon Musk"
    }
  ],
  "messages": [
    {
      "role": "joe_rogan",
      "text": "One of the things that I’ve said is that there could be potentially a universal language that’s created through computers that particularly young kids would pick up very quickly. Like, my kids do Tik Tok and all this jazz, and I don’t know what they’re doing. They just know how to do it, and they know how to do it really quickly. Like they learn really quickly, and they show me how to edit things.\nIt’s if you taught a child from first grade on how to use some new universal language, essentially like a\nRosetta Stone\n, and something that’s done with that interprets your thoughts and you can convey your thoughts with no room for interpretation, clear, very clear, where you know what a person’s saying. And you could tell them what you’re saying, and there’s no need for noises, no need for mouth noises. No need for these sort of accepted ways that we’ve evolved to make sounds that we all agree, through our cultural dictionary, and we agree. We could bypass all that."
    },
    {
      "role": "elon_musk",
      "text": "You can still do it for sentimental reasons."
    },
    {
      "role": "joe_rogan",
      "text": "Like campfires."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, exactly. You don’t need campfire. Don’t need to roast marshmallows to have fun."
    },
    {
      "role": "joe_rogan",
      "text": "Right."
    },
    {
      "role": "elon_musk",
      "text": "So, yeah, I think in principle you would be able to communicate very quickly and with far more precision ideas. Language would – I’m not sure what would happen to language. In a situation like this, you would be able to just…- it’d be kind of like\nThe Matrix\n. If you want to speak a different language – no problem."
    },
    {
      "role": "joe_rogan",
      "text": "Right."
    },
    {
      "role": "elon_musk",
      "text": "Just download the program."
    },
    {
      "role": "joe_rogan",
      "text": "Right. So at least for the first iterations, first few iterations. I know that Google has…- some of their pixel buds have the ability to interpret languages in real-time."
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. You can hear it, and it’ll play things back to you in whatever language you choose. So it’d be something along those lines? For the first few iterations?"
    },
    {
      "role": "elon_musk",
      "text": "Well, the first few iterations are… – what I’m talking about is in the limit over time, with a lot of development. The first few iterations, really, in the first few versions, all we’re going to be trying to do is solve brain injuries. So, don’t worry. It’s not going to sneak up on you. This will take a while."
    },
    {
      "role": "joe_rogan",
      "text": "How many years? Before you don’t have to talk."
    },
    {
      "role": "elon_musk",
      "text": "If the development continues to accelerate, then maybe five years. Five to 10 years."
    },
    {
      "role": "joe_rogan",
      "text": "That’s quick. That’s really quick."
    },
    {
      "role": "elon_musk",
      "text": "That’s the best-case scenario."
    },
    {
      "role": "joe_rogan",
      "text": "No talking anymore in five years."
    },
    {
      "role": "elon_musk",
      "text": "Best case scenario, but ten years is more likely."
    },
    {
      "role": "joe_rogan",
      "text": "I’ve always speculated that aliens could potentially be us in the future because if you look at the size of their heads and the fact that they have very little muscle, they don’t use their mouth anymore. They have this tiny little…- I mean the archetype of an alien that you see in like “Close Encounters of the Third Kind” – they’re like if you went from Australopithecus or ancient hominid to us, what’s the difference? Less hair, less muscle, bigger head.\nAnd then just keep going. A thousand, a million, whatever years; or five years, whatever. Whatever happens when Neuralink goes on online, and then we slowly start to adapt to this new way of being where we don’t use our muscles anymore. We have this gigantic head; we can talk without words."
    },
    {
      "role": "elon_musk",
      "text": "You could also save state."
    },
    {
      "role": "joe_rogan",
      "text": "Save state?"
    },
    {
      "role": "elon_musk",
      "text": "Save state, like save your brain state like a saved game in a video game."
    },
    {
      "role": "joe_rogan",
      "text": "Whoa. Like if you want to swap from Windows 95."
    },
    {
      "role": "elon_musk",
      "text": "Well, hopefully, a little better than that. But, yeah."
    },
    {
      "role": "joe_rogan",
      "text": "I think we are Windows 95 right now."
    },
    {
      "role": "elon_musk",
      "text": "From a future perspective, probably. But yeah, I mean, you could save state  and restore that state into a biological being if you wanted to in the future in principle. It’s like nothing from a physics standpoint that prevents us. You’d be a little different, but you’re also a little different when you wake up in the morning from yesterday, and you’re a little different in fact, if you say like ‘you five years ago’ versus ‘you today’ is quite a big difference."
    },
    {
      "role": "joe_rogan",
      "text": "Yes."
    },
    {
      "role": "elon_musk",
      "text": "So you’d be substantially you. I mean, you’d certainly think you’re you."
    },
    {
      "role": "joe_rogan",
      "text": "But the idea of saving yourself and then transforming that into some sort of a biological state, you can hang out with 30 year old you?"
    },
    {
      "role": "elon_musk",
      "text": "I mean, the possibilities are endless."
    },
    {
      "role": "joe_rogan",
      "text": "It’s so weird."
    },
    {
      "role": "elon_musk",
      "text": "I mean, just think like how your phone…- you can record videos from your phone. There’s no way you could remember a video as accurately as your phone or a camera could. So now, if you’ve got like some version 10 Neuralink, whatever and far in the future, you could recall everything, just like it’s a movie."
    },
    {
      "role": "joe_rogan",
      "text": "Crystal clear."
    },
    {
      "role": "elon_musk",
      "text": "Including all the entire sensory experience."
    },
    {
      "role": "joe_rogan",
      "text": "Emotions, everything."
    },
    {
      "role": "elon_musk",
      "text": "Everything and play it back, and in fact, you can edit it."
    },
    {
      "role": "joe_rogan",
      "text": "Edit it?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "So you can change your past?"
    },
    {
      "role": "elon_musk",
      "text": "You could change what you think was your past. Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Well, so if you had a dramatic experience?"
    },
    {
      "role": "elon_musk",
      "text": "This whole thing right now could be a replayed memory."
    },
    {
      "role": "joe_rogan",
      "text": "It could be."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "It may be. What’s the odds of this being a replayed memory? If you had a guess. More than 50%?"
    },
    {
      "role": "elon_musk",
      "text": "There’s no way to assign a probability with accuracy here."
    },
    {
      "role": "joe_rogan",
      "text": "Right. But roughly, if you had a…- just gut instinct."
    },
    {
      "role": "elon_musk",
      "text": "Well, I don’t have a Neuralink in my brain, so I’d say right now 0%, but at the point at which you do have a Neuralink, then it rises above 0%."
    },
    {
      "role": "joe_rogan",
      "text": "The idea that we’re experiencing some sort of a preserved memory is, even though it’s still the same, it’s not comforting. Right? For some reason, when people talk about simulation theory, they talk about the potential for this currently being a simulation. Even though your life might be wonderful, you might be in love, you might love your career, you might have great friends, but it’s not comforting to know that this experience somehow or another doesn’t exist in a material form that you can knock on.\n(knocks on the table)"
    },
    {
      "role": "elon_musk",
      "text": "(knocks on the table, too)\nIt feels real, doesn’t it?"
    },
    {
      "role": "joe_rogan",
      "text": "It feels real. But the idea that it’s not, for some strange reason, is disconcerting."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I’m sure it should be disconcerting because if this is not real, what is? But, there’s that old sort of thought experiment of like, how do you know you’re not a brain in a vat? I mean, now here’s the thing: You are a brain in a vat, and that vat is your skull."
    },
    {
      "role": "joe_rogan",
      "text": "Yes."
    },
    {
      "role": "elon_musk",
      "text": "Everything you see, feel, hear, everything, all your senses are electrical signals, everything. Everything is an electrical signal to a brain in a vat, with the vat is your skull."
    },
    {
      "role": "joe_rogan",
      "text": "All your hormones, all your neuro-transmitters, all these things are drugs. Adrenaline’s a drug. Dopamine is a drug. You’re a drug factory. You’re constantly changing your state with love and oxytocin and beauty."
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "Changes your state. Great music changes your state."
    },
    {
      "role": "elon_musk",
      "text": "Absolutely. Yet, here’s another sort of interesting idea, which is, because you say like where did consciousness arise? Well, assuming you believe the belief in physics, which proves to be true, then the universe started off as basically quarks and leptons, and it quickly became hydrogen and helium, lithium, like, basically elements of the periodic table. But it was mostly hydrogen, basically. Then over a long period of time, 13.8 billion years later that hydrogen became sentient. Where along the way did consciousness…- What’s the line of consciousness and not consciousness between hydrogen and here?"
    },
    {
      "role": "joe_rogan",
      "text": "When do we call it, when do we call it consciousness? I was watching a video today that we played on a podcast earlier of a monkey riding a motorcycle down the street, jumps off the motorcycle, and tries to steal a baby."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I saw that one. It went viral."
    },
    {
      "role": "joe_rogan",
      "text": "Is that monkey conscious? It seems like it is. It seems like it had a plan. It was riding a fucking motorcycle and then jumped off the motorcycle to try to steal a baby."
    },
    {
      "role": "elon_musk",
      "text": "The one that just dragged the baby down the street pretty far?"
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. It seems pretty conscious, right?"
    },
    {
      "role": "elon_musk",
      "text": "There’s definitely some degree of consciousness there."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. It’s not like a worm. It seems to be on another level. Yeah, and it’s going to keep going. That’s the real concern when people think about the potential future versions of human beings, especially when you consider symbiotic relationship to artificial intelligence, that will be unrecognizable. That one day will be so far removed from what this is. We’ll look back on this, the way we look back now on simple organisms that we evolved from. That it won’t be that far in the future that we do have this view back."
    },
    {
      "role": "elon_musk",
      "text": "Well, I hope consciousness propagates into the future, and it gets more sophisticated and complex and that it understands the questions to ask about the universe."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think that’s the case? As a human being, as yourself, you’re clearly trying to make conscious decisions to be a better version of yourself. This is the idea of getting rid of your possessions and realizing that you’re trying to like, “I don’t like this. I will try to improve this. I would try to do a better version of the way I interface with reality.”\nThat this is always the way things are, if you’re moving in some sort of a direction where you’re trying to improve things, you’re always going to move into this new place where you look back on the old place and go, “I was doing it wrong back then.” So this is an accelerated version of that. A super accelerated version of that."
    },
    {
      "role": "elon_musk",
      "text": "I mean, you don’t always improve, but you can aspire to improve, or you can aspire to be less wrong."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah."
    },
    {
      "role": "elon_musk",
      "text": "This is like, I think the tools of physics are very powerful. Just assume you’re wrong and aspire your goal is to be less wrong. I don’t think you’re going to succeed every day in being less wrong, but if you’re going to succeed in being less wrong most of the time, you’re doing great."
    },
    {
      "role": "joe_rogan",
      "text": "That’s a great way of putting it. Aspire to be less wrong. But then when people look back in nostalgia about simpler times, there’s that too. It’s very romantic and exciting to look back on campfires."
    },
    {
      "role": "elon_musk",
      "text": "But you still can have a campfire."
    },
    {
      "role": "joe_rogan",
      "text": "Yes. But will you appreciate it when you’re a super nerd? When you connect it to the grid, and you have some skull cap in place of the top of your head, and it’s interfacing with the international language that the rest of the universe now enjoys communication with people?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Sure. I think so. Yeah. I like campfires."
    },
    {
      "role": "joe_rogan",
      "text": "I’m just worried. I mean, everyone’s always scared of change, but I’m scared of this monumental change where we won’t talk anymore."
    },
    {
      "role": "elon_musk",
      "text": "We’ll communicate."
    },
    {
      "role": "joe_rogan",
      "text": "Yes, but there’s something about the beauty of the crudeness of language where when it’s done eloquently, it’s satisfying, and it hits us in some sort of a visceral way. Like, ah, that person nailed it. I love that they nailed it. That it’s so hard to capture a real thought and convey it in a way, in this articulate way. You read a quote, a great quote by a wise person. It makes you excited that their mind figured something out, put the words together in a right way that makes your brain pop like, “Oh yes. Yes.”"
    },
    {
      "role": "elon_musk",
      "text": "It’s clever compression of a concept and a feeling."
    },
    {
      "role": "joe_rogan",
      "text": "But the fact that a human did it too."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, absolutely."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think that it will be like electronic music? Like people won’t appreciate it like they appreciate a slide guitar?"
    },
    {
      "role": "elon_musk",
      "text": "I like electronic music."
    },
    {
      "role": "joe_rogan",
      "text": "I do too. Well, you make it. I know you like it."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, I mean, I hope the future is more fun and interesting, and we’re just trying to make it that way."
    },
    {
      "role": "joe_rogan",
      "text": "I hope it’s more fun and interesting too."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "I just hope we don’t lose anything along the way."
    },
    {
      "role": "elon_musk",
      "text": "We might lose a little, but hopefully, we gain more than lose."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. That’s the thing, right? Gaining more than we lose. Something that makes us interesting is that we’re so flawed."
    },
    {
      "role": "elon_musk",
      "text": "That’s for sure. I mean, look at civilization through the ages; most of them they rose and fell."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah."
    },
    {
      "role": "elon_musk",
      "text": "I do think the globalization that we have, sort of like the memesphere, there’s not enough isolation between countries or regions. It’s like if there’s a mind virus that that mind virus cannot infect too much of the world. I actually sort of sympathizing with the anti-globalization people because it’s like, man,  we don’t ever want everywhere to be the same for sure. Then we need some kind of mind viral immunity. So that’s a bit concerning."
    },
    {
      "role": "joe_rogan",
      "text": "Mind viral immunity, meaning that once something like Neuralink gets established, the real concern is something that..- I mean, you said it’s Bluetooth, right? Or some future version of that? The idea is that something could possibly get into it, fuck it up."
    },
    {
      "role": "elon_musk",
      "text": "No, I’m talking about, like somebody, some cockeyed concept that happens right now."
    },
    {
      "role": "joe_rogan",
      "text": "Well, I know this virus is in embedded chips, right? They’ve embedded chips and then acquired viruses."
    },
    {
      "role": "elon_musk",
      "text": "Well, when I’m talking about a mind virus, I’m talking about a concept that infects people’s minds."
    },
    {
      "role": "joe_rogan",
      "text": "Oh, okay. Okay. Like cult thinking or some sort of fundamentalism."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Just a wrongheaded idea that goes viral in an ideal sense."
    },
    {
      "role": "joe_rogan",
      "text": "Well, that is a problem too, right, if someone can manipulate that technology to make something appear logical or rational?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Would that be an issue too? This is a very ‘have’ versus ‘have not’ issue. If this really does…- I mean, initially, it’s going to help people with injuries, but you said ultimately it could lead to this spectacular cognitive change."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "But the people that first get it should have a massive advantage over people that don’t have it yet."
    },
    {
      "role": "elon_musk",
      "text": "Well, I mean, it’s the kind of thing where your productivity would improve, I don’t know, dramatically, maybe by a factor of 10 with it. So you could definitely just, I don’t know, take out a loan and do it and earn the money back real fast. Be super smart."
    },
    {
      "role": "joe_rogan",
      "text": "Well, in a capitalist society, it seems like you could really get so far ahead that before everybody else could afford this thing and link up and get connected as well, you’d be so far ahead, they can never catch you. Is that a concern?"
    },
    {
      "role": "elon_musk",
      "text": "Well, it’s not a super huge concern. I mean, there are huge differences in cognitive ability and resources already. You can think of a corporation as like a cybernetic collective that’s far smarter than an individual. I couldn’t personally build a whole rocket and the engines and launch it and everything. That’s impossible.\nBut we have 8,000 people at SpaceX, and you’re piecing it out to different people and using computers and machines and stuff. We can make lots of rockets launch into orbit, dock with the space station, and that kind of thing. So that already exists where those corporations are vastly more capable than an individual. But we should be, I think, less concerned about relative capabilities between people and more like having AI be vastly beyond us and decoupled from human will."
    },
    {
      "role": "joe_rogan",
      "text": "Decoupled from humans. So this is the ‘if you can’t beat them, join them’?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "So you feel like it’s inevitable, like an AI, a sentient AI, is essentially inevitable?"
    },
    {
      "role": "elon_musk",
      "text": "Super sentient AI. Like beyond a level that’s difficult to understand and impossible to understand probably."
    },
    {
      "role": "joe_rogan",
      "text": "Somehow or another, so it’s almost like it’s a requirement for survival to achieve some sort of symbiotic existence with AI."
    },
    {
      "role": "elon_musk",
      "text": "It’s not a requirement. It’s just if you want to be along for the ride, then you need to do some kind of symbiosis. So the way your brain works right now, you’ve got kind of like the animal brain, reptile brain, kind of like the limbic system basically. And you’ve got the cortex. Now the brain purist will argue with this definition, but essentially you’ve got the primitive brain, and you’ve got the sort of smart brain or the brain that’s capable of planning and understanding concepts and difficult things that a monkey can’t understand.\nNow your cortex is much, much  smarter than your limbic system. Nonetheless, they work together well. So I haven’t met anyone who wants to delete their limbic system or their cortex. People are quite happy having both. So you can think of this as being like the computer; the AI is like a third layer, a tertiary layer. So that could be symbiotic with the cortex. It’d be much smarter than the cortex, but you essentially have three layers, and you actually have that right now.\nYour phone is capable of things, and your computer is capable of things that your brain is definitely not. Storing terabytes of information perfectly, doing incredible calculations that we couldn’t even come close to doing. You have that with your computer. It’s just like I said, the data rate is slow, the connection is weak."
    },
    {
      "role": "joe_rogan",
      "text": "Why is it so disconcerting, or why does it not give me comfort to think about it? Like when I think about a symbiotic connection to AI, I always think of this cold, emotionless sort of thing that we will become. Is that a bad way to look at it?"
    },
    {
      "role": "elon_musk",
      "text": "I don’t think that’s not how it would be. Like I said, you already are symbiotic with AI or computers."
    },
    {
      "role": "joe_rogan",
      "text": "Phones, computers, laptops."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, there’s quite a bit of AI going on, artificial neural nets. Increasingly, neural nets are sort of taking over from regular programming more and more. So you are connected; if you use Google Voice or Alexa or one of those things, it’s using a neural net to decode your speech and try to understand what you were saying.\nIf you’re trying to do image recognition or improve the quality of photographs, the neural nets the best way to do that. So you are already sort of a cybernetic symbiote. Like I said, it’s just a question of your data rate. The communication speed between your phone and your brain is slow."
    },
    {
      "role": "joe_rogan",
      "text": "When do you think you’re going to do it? How long will you wait? Once it starts becoming available?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, if it works, I’ll do it. Sure."
    },
    {
      "role": "joe_rogan",
      "text": "Right away."
    },
    {
      "role": "elon_musk",
      "text": "I mean, let’s make sure it works."
    },
    {
      "role": "joe_rogan",
      "text": "How do we make sure it works? We try it on prisoners? What do you do? Take rapists? Cut holes in their head?"
    },
    {
      "role": "elon_musk",
      "text": "No, like I said if somebody has got a serious brain injury and people that have very severe brain injuries and then you can fix those brain injuries. Then you prove out that it works and envelope expands and make more and more brain injuries, solve more and more. At a certain age, we all are going to get Alzheimer’s, or we’re all going to get senile. Then moms forget the names of their kids and that kind of thing.\nIt’s like you said, okay, well this would allow you to remember your names of your kids and have a normal, a much more normal life where you were able to function much later in life. So I think essentially almost everyone would find a need at some point if you get old enough to use a neural link. Then it’s like, okay, so we can improve the functionality and improve the communication speed. So then you will not have to use your thumbs to communicate with the computer."
    },
    {
      "role": "joe_rogan",
      "text": "Do you ever sit down and extrapolate? Do you ever sit down and think about all the different iterations of this and what this eventually leads to?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, sure. I think about it a lot. Like I said, this is not something that’s going to sneak up on you. Getting FDA approval for this stuff is not overnight. I don’t know; we probably have to be on version 10 or something before it would realistically be a human AI symbiote situation. You’ll see it coming."
    },
    {
      "role": "joe_rogan",
      "text": "You see it coming, but what do you think it’s going to be? When you’re alone, if you have free time, I don’t know if you have free time,  but if you just sit down and think about this iteration, the next, onward, keep going, and you drag it out with improvements along the way and leaps and bounds and technological innovations. Where do you see it? What are we going to be?"
    },
    {
      "role": "elon_musk",
      "text": "Like when?"
    },
    {
      "role": "joe_rogan",
      "text": "20, 25 years from now? What are we going to be?"
    },
    {
      "role": "elon_musk",
      "text": "Well, assuming civilization is still around, it’s looking fragile right now. I think we could have…- in 25 years probably, I would think there could be a whole brain interface."
    },
    {
      "role": "joe_rogan",
      "text": "A whole brain interface?"
    },
    {
      "role": "elon_musk",
      "text": "Something pretty close to that. Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "What do you mean by whole brain interface?"
    },
    {
      "role": "elon_musk",
      "text": "Almost all the neurons are connected to the sort of AI extension of yourself. If you want."
    },
    {
      "role": "joe_rogan",
      "text": "AI extension of yourself."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "What does that mean to you when you say AI Extension of yourself?"
    },
    {
      "role": "elon_musk",
      "text": "Well, like I said, you already have a computer extension of yourself with your phone and computers and stuff. So, and now online, it’s like somebody dies, there’s like an online ghost, they’re still… their online stuff is still alive."
    },
    {
      "role": "joe_rogan",
      "text": "That’s a good way to put it. It is weird when you read someone’s tweets after they’re dead."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah."
    },
    {
      "role": "elon_musk",
      "text": "Instagram and their stories and whatever, Facebook and stuff, the e-mails…"
    },
    {
      "role": "joe_rogan",
      "text": "That’s a great way to put it. It’s like an online ghost. That’s very accurate."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. So it would just be that more of you would be in the cloud, I guess, than in your body."
    },
    {
      "role": "joe_rogan",
      "text": "Whoa. Now, when you say civilization’s fragile, do you mean because of this COVID-19 shit that’s going on right now?"
    },
    {
      "role": "elon_musk",
      "text": "What’s that? I never heard of it."
    },
    {
      "role": "joe_rogan",
      "text": "It’s this thing, it’s like some people just get a cough."
    },
    {
      "role": "elon_musk",
      "text": "I have no idea what you’re talking about."
    },
    {
      "role": "joe_rogan",
      "text": "Other people, it gets much worse."
    },
    {
      "role": "elon_musk",
      "text": "Sure. Well, yeah. I mean, this certainly has taken over the mind space of the world to a degree that is quite shocking."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. Well, out of nowhere. That’s what’s crazy. It’s like you go back to November, nothing. Now here we are, December, January, February, March, April, May, six months. Totally different world. So from nothing to, everything’s locked down. There’s so much conflicting information and conflicting opinions about how to proceed. What has happened? You find things where there was a meatpacking plant, I believe in Missouri where 300 plus people were asymptomatic, tested positive asymptomatic.\nThen in other places, it just ravages entire communities and kills people, and it’s so weird. It almost appears, if you didn’t know any better, you’d be like, what? It seems like there’s a bunch of different viruses. It doesn’t seem like it’s the same thing or has a bunch of different reactions to the biological variety of people."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, I mean, I kind of saw this whole thing play out in China before it played out in the US. So it’s kind of like watching the same movie again but in English. I think the mortality rate is much less than what the World Health Organization said it was. It’s much, much less. It’s like probably at least an order of magnitude less."
    },
    {
      "role": "joe_rogan",
      "text": "Well, it seems to be very deadly to very specific kinds of people and people with specific problems."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I mean, you can look at the mortality statistics by age and whether they have comorbidities, like do they have basically existing conditions and by age. If you’re below 60 and have no serious health issues, the probability of death is extremely low. It’s not zero, but it’s extremely low."
    },
    {
      "role": "joe_rogan",
      "text": "They didn’t think that this was the case, though, when they first started to lock down the country. Do you think that it’s a situation where once they’ve proceeded in a certain way, it’s very difficult to correct course?"
    },
    {
      "role": "elon_musk",
      "text": "It’s almost like people really wanted a panic. It’s quite crazy."
    },
    {
      "role": "joe_rogan",
      "text": "But in some places, a panic is deserved, right? Like if you’re in the ICU in Manhattan and people are dying left and right and everyone’s on intubators. It seems like when you see all these people on ventilators, and so many of them are dying, and you see these nurses are dying and doctors are getting sick. In some places, that fear is justified, but then in other places, you’re reading these stories about hospitals that are essentially half empty. They’re having to furlough doctors and nurses because there’s no work for them."
    },
    {
      "role": "elon_musk",
      "text": "Most of the hospitals in the United States right now are half empty. In some cases, they’re at 30% capacity."
    },
    {
      "role": "joe_rogan",
      "text": "Is this because they’ve decided to forgo elective procedures and normal things that people would have to go to the hospital for?"
    },
    {
      "role": "elon_musk",
      "text": "Yes. I mean, we’re not talking about just…- some of these elective procedures are quite important. Like you have a bad heart."
    },
    {
      "role": "joe_rogan",
      "text": "Gall bladder disease, yeah, sure."
    },
    {
      "role": "elon_musk",
      "text": "You need a triple bypass. It’s sort of elective, but if you don’t get it done in time, you’re going to die."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, elective is a weird word."
    },
    {
      "role": "elon_musk",
      "text": "Elective. It’s not like…- this isn’t like plastic surgery."
    },
    {
      "role": "joe_rogan",
      "text": "Right, right."
    },
    {
      "role": "elon_musk",
      "text": "It’s more like my hip is…- I’m in extreme pain because my hip’s blown out or my knee, and I don’t want to go to the hospital. I can’t go to the hospital. People are in extreme pain, people that need a kidney, people that have quite serious issues that are choosing not to go out of fear. So I think it’s a problem; that’s not good."
    },
    {
      "role": "joe_rogan",
      "text": "It seems like the state of public perception is shifting."
    },
    {
      "role": "elon_musk",
      "text": "It is."
    },
    {
      "role": "joe_rogan",
      "text": "Like people are taking some deep breaths and relaxing, and because of the statistics, essentially across the board, it’s being recognized that it’s not as fatal as we thought it was. Still dangerous, still worse than a flu, but not as bad as we thought or we feared it could be."
    },
    {
      "role": "elon_musk",
      "text": "Objectively, the mortality is much lower. At least a factor of 10, maybe a factor of 50 lower than initially thought."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think that the current way we’re handling this, the social distancing, the mask, the locking down, does this make sense? Is it adequate? Or do you think that we should move back to at least closer to where we used to be?"
    },
    {
      "role": "elon_musk",
      "text": "Well, I think proper hygiene is a good thing no matter what."
    },
    {
      "role": "joe_rogan",
      "text": "Yes."
    },
    {
      "role": "elon_musk",
      "text": "Wash your hands and if you’re coughing, stay at home or wear a mask because it’s not good. They do that in Japan. That’s normal. If you’re ill, you wear a face mask, and you don’t cough on people. I think that would be a great thing to adopt in general throughout the world. Washing your hands is also good."
    },
    {
      "role": "joe_rogan",
      "text": "Well, there’s a speculation why men get it more than women because men are disgusting. We don’t wash our hands as much."
    },
    {
      "role": "elon_musk",
      "text": "Men are disgusting, it’s true. It’s bad."
    },
    {
      "role": "joe_rogan",
      "text": "It’s true, I admit it, we are all men in this room. We’re all gross."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Just go to the restroom; you can see it’s horrible."
    },
    {
      "role": "joe_rogan",
      "text": "Yes, we’re gross. My nine-year-old daughter yells at me; she goes, “Did you wash your hands?” She makes me go back and wash my hands. She’s right. Nine years old. If I had a nine-year-old boy, do you think he would care? He wouldn’t give a fuck if I washed my hands."
    },
    {
      "role": "elon_musk",
      "text": "True. And I think that there’s definitely some silver linings here in improved hygiene and-"
    },
    {
      "role": "joe_rogan",
      "text": "And awareness of potential."
    },
    {
      "role": "elon_musk",
      "text": "Yes. I think this has shaken up the system. The system is somewhat moribund with lot of layers of bureaucracy, and I think that we’ve cut through some of that bureaucracy. And at some point, there probably will be a pandemic with a high mortality rate. Debate about like what’s high, but I mean something that’s killing a lot of 20-year-olds, let’s say. Like if you had Ebola type of mortality."
    }
  ]
}