{
  "src": "https://elon-musk-interviews.com/2021/02/24/the-joe-rogan-experience-1169-elon-musk-v-english/",
  "speakers": [
    {
      "id": "elon_musk",
      "name": "Elon Musk"
    },
    {
      "id": "joe_rogan",
      "name": "Joe Rogan"
    },
    {
      "id": "jaime",
      "name": "Jaime"
    }
  ],
  "messages": [
    {
      "role": "elon_musk",
      "text": "And I, actually, had this conversation at dinner several years ago with a district attorney. I was like, „Man, it must, sometimes, seem pretty, pretty dark because, you know, man, there’s some terrible human beings out there. And he was like, „Yup.“ And he was like dealing with some case, which consisted of a couple of old ladies that would run people over somehow for insurance money. It was rough. Like, „Wow, that’s pretty rough.“ It’s hard to maintain faith in humanity if you’re a district attorney,   but, you know, it’s only a few percent of society that are actually bad.\nAnd then if you go to the worst, say 0.1% of the society of the worst, one in a thousand, one in a million, you know. Like how bad is the millionth worst person in the United States? Pretty damn bad. Like damn evil. One in a million of evil is so evil; people cannot even conceive of it. But there are 330 million people in the United States. So, that’s 330 people out there somewhere. But by the same token, there are also 330 people who are incredible angels and unbelievably good human beings on the other side."
    },
    {
      "role": "joe_rogan",
      "text": "But because of our fear of danger, we tend to — our thoughts tend to gravitate towards the worst-case scenario. And we want to frame that. And that’s one of the real problems with prejudice; whether it’s prejudice towards different minorities, or prejudice towards police officers, or anything, it’s like we want to look at the worst-case scenario and say, „This is an example of what this is all about.“\nAnd you see that even with people, how they frame genders. Some men frame women like that. They get ripped off by a few women, and they decide, „All women are evil.“ Some women get fucked over by a few men, „All men are shit.“ And this is very toxic.And it’s also — It’s a very unbalanced way of viewing the world, and it’s very emotionally based, and it’s based on your own experience, your own anecdotal experience. And it can be very influential to the people around you, and it’s just a dangerous way. It’s a dangerous thought process and pattern to promote."
    },
    {
      "role": "elon_musk",
      "text": "It is. It is a very dangerous pattern. I really think people should give other people the benefit of the doubt and assume that they are good until proven otherwise. And, I think, really, most people are actually pretty good people. Nobody’s perfect."
    },
    {
      "role": "joe_rogan",
      "text": "They have to be. If you think of vast numbers of us that are just interacting with each other constantly – we have to be better than we think we are.There’s no other way."
    },
    {
      "role": "elon_musk",
      "text": "I mean, here are these weapons but how many times, like, …nobody’s presumably try to murder you and you’re-"
    },
    {
      "role": "joe_rogan",
      "text": "Nobody yet."
    },
    {
      "role": "elon_musk",
      "text": "Yes, nobody. It’s like the sword right there."
    },
    {
      "role": "joe_rogan",
      "text": "Not the flamethrower, fake flamethrower here-"
    },
    {
      "role": "elon_musk",
      "text": "Exactly."
    },
    {
      "role": "joe_rogan",
      "text": "It’s not a flamethrower. Now, we’ve got a real problem, I’m going to put it on that side, too, and leave it for the guests."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "I’m like, „Look, man, if I say something that fucked up, it’s right there.“"
    },
    {
      "role": "elon_musk",
      "text": "It will liven things up for sure. It’s guaranteed to make any party better."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. Well, that’s — I mean, that’s the armed civilization theory, right. An armed community is a safe and polite community. You know, in Texas, it’s kind of true. People in Texas are super polite. Therefore – they’ve got a gun."
    },
    {
      "role": "elon_musk",
      "text": "Yes. Don’t make somebody angry.You don’t know what’s going to happen."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, it’s not a good move to piss people off when everybody can have a gun."
    },
    {
      "role": "joe_rogan",
      "text": "You’re off to just let that guy get in your lane."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. You know, we got a big test site in Central Texas near Waco."
    },
    {
      "role": "joe_rogan",
      "text": "Oh yeah? Beautiful."
    },
    {
      "role": "elon_musk",
      "text": "Yes, Space X in McGregor. It’s about 15 minutes away from Waco."
    },
    {
      "role": "joe_rogan",
      "text": "That’s close to where Ted Nugent lives."
    },
    {
      "role": "elon_musk",
      "text": "It is?"
    },
    {
      "role": "joe_rogan",
      "text": "Shout out to Ted Nugent."
    },
    {
      "role": "elon_musk",
      "text": "Okay, cool."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, there’s — You know, we have lots of fire, and loud explosions, and things, and people are cool with it."
    },
    {
      "role": "joe_rogan",
      "text": "They don’t give a fuck out there."
    },
    {
      "role": "elon_musk",
      "text": "They’re very supportive."
    },
    {
      "role": "joe_rogan",
      "text": "You can buy fireworks where, you know, your kids go to school."
    },
    {
      "role": "elon_musk",
      "text": "You know, it’s dangerous."
    },
    {
      "role": "joe_rogan",
      "text": "Yes\n,\nbut it’s free."
    },
    {
      "role": "elon_musk",
      "text": "It’s free."
    },
    {
      "role": "joe_rogan",
      "text": "There’s something about Texas that’s very enticing because of that. It is dangerous, but it’s also free."
    },
    {
      "role": "elon_musk",
      "text": "Right. I kind of like Texas, actually."
    },
    {
      "role": "joe_rogan",
      "text": "I prefer it over places that are more restrictive but more liberal because you could always be liberal. Like just because things are free and just because you have a certain amount of, you know, right-wing type characters, it doesn’t mean you have to be that way, you know.And, honestly, there’s a lot of those people that are pretty fucking open-minded and let you do whatever you want to do. As long as you don’t bother them."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, exactly."
    },
    {
      "role": "joe_rogan",
      "text": "That’s my hope right now with the way we’re able to communicate with each other today, and how radically different it is than generations past is that we all just, the dust settles. We all realize, like what you’re saying, that most people are good."
    },
    {
      "role": "jaime",
      "text": "Most people are good."
    },
    {
      "role": "joe_rogan",
      "text": "The vast majority."
    },
    {
      "role": "elon_musk",
      "text": "Yes. I think if you give people the benefit of doubt, for sure."
    },
    {
      "role": "joe_rogan",
      "text": "I think you’re right. Do you know who could help with that? Mushrooms."
    },
    {
      "role": "elon_musk",
      "text": "Mushrooms."
    },
    {
      "role": "joe_rogan",
      "text": "Don’t you think?"
    },
    {
      "role": "elon_musk",
      "text": "They’re delicious."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, right. They’re good for you too. All of them. All kinds of them.\nWhat do you see in terms of, like, when you think about the future of your companies,  what do you see as bottlenecks? What do you see in terms of bottlenecks of things that are holding back innovation? Is it regulatory commissions and people that don’t understand the technology that is influencing policy? What could potentially be holding you guys back right now? Is there anything that you would change?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, that’s a good question. You know, I wish politicians were better at science. That would help a lot."
    },
    {
      "role": "joe_rogan",
      "text": "That’s a problem."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "There’s no incentive for them to be good at science."
    },
    {
      "role": "elon_musk",
      "text": "There isn’t. Actually, you know, they’re pretty good at science in China, I have to say. The mayor of Beijing has, I believe, an environmental engineering degree, and the deputy mayor has a physics degree. I met them, and the mayor says, „Shanghai is really smart and-„"
    },
    {
      "role": "joe_rogan",
      "text": "You’re up on technology. What do you think about this government policy of stopping the use of Huawei phones? And there’s something about the worry about spying. I mean, from what I understand from real tech people, they think it’s horseshit."
    },
    {
      "role": "elon_musk",
      "text": "I don’t know."
    },
    {
      "role": "joe_rogan",
      "text": "Like the government say, „Don’t you buy Huawei phones.“ Are you up on that at all? No? Should we just abandon this idea?"
    },
    {
      "role": "elon_musk",
      "text": "If you have like top secret stuff, then you want to be pretty careful about what hardware you use. But, you know, like most people do not have top-secret stuff. Nobody really cares what porn you watch. It’s like nobody actually cares, you know. So-."
    },
    {
      "role": "joe_rogan",
      "text": "If they do, that’s kind of on them."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. National spy agencies do not give a rat’s ass which porn you watch. They do not care. So, like, what secrets does a national spy agency have to learn from the average citizen? Nothing."
    },
    {
      "role": "joe_rogan",
      "text": "Well, that’s the argument against the narrative. And the argument by a lot of these tech people is that the real concern is that these companies, like Huawei, are innovating at a radical pace, and they’re trying to stop them from integrating into our culture and letting this… Like right now, they’re the number two cell phone manufacturer in the world.Samsung is number one. Huawei is number two. Apple is now number three. They surpassed Apple as number two. And the idea is that this is all taking place without them having any foothold whatsoever in America. There are no carriers that have their phones. You have to buy their phones unlocked through some sort of a third party, and then put-"
    },
    {
      "role": "elon_musk",
      "text": "Okay."
    },
    {
      "role": "joe_rogan",
      "text": "And the worry is, you know, that these are somehow another controlled by the Chinese government. The Communist Chinese government is going to distribute these phones. And I don’t know if the worry’s economic influence or they’ll have too much power. I don’t know what it is. Are you paying attention to any of this?"
    },
    {
      "role": "elon_musk",
      "text": "Not really.I don’t think we should worry too much about Huawei phones, you know. Maybe a national security agency shouldn’t have Huawei phones. Maybe that’s a question mark. But I think for the average citizen, this doesn’t matter. Just like no, they’re not. I’m pretty sure the Chinese government does not care about the goings of the average American citizen."
    },
    {
      "role": "joe_rogan",
      "text": "Is there a time where you think that there will be no security, will be impossible to hold back information that whatever bottleneck we’ll let go, we’re going to give in? That whatever bottleneck between privacy and ultimate innovation will have to be bridged in order for us to achieve the next level of technological proficiency that we’re just going to abandon it, and there’ll be no security, no privacy?"
    },
    {
      "role": "elon_musk",
      "text": "Do people want privacy? Because they seem to put everything on the internet. Practically-."
    },
    {
      "role": "joe_rogan",
      "text": "Well, right now, they are confused, but when you’re talking about your Neuralink, and this idea that one day, we’re going to be able to share information, and we’re going to be some sort of a thing that’s symbiotically connected?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I think we really need to worry about security in that situationfor sure. That’s like security paramount."
    },
    {
      "role": "joe_rogan",
      "text": "But, also, what we will be. This will be so much different. Our concerns about money, about status, about all these things, will seemingly go by the wayside if we really become enlightened, if we really become artificially enlightened by some sort of an AI interface where we have this symbiotic relationship with some new internet type connection to information.  But, you know, what happens then? What is important? What is not important? Is privacy important when we’re all gods?"
    },
    {
      "role": "elon_musk",
      "text": "I think the things that we think are important to keep private right now we probably will not think are important to keep…"
    },
    {
      "role": "joe_rogan",
      "text": "Shame, right? Information, right? What do you hide? Emotions? What are we hiding?"
    },
    {
      "role": "elon_musk",
      "text": "I don’t know. Maybe it’s like embarrassing stuff."
    },
    {
      "role": "joe_rogan",
      "text": "Right, embarrassing stuff."
    },
    {
      "role": "elon_musk",
      "text": "But I think there’s not that much that’s kept private by people that is actually relevant.That other people would actually care about. When you think other people care about it, but they don’t really care about it. And, certainly, governments don’t."
    },
    {
      "role": "joe_rogan",
      "text": "Well, some people care about it. But then, it gets weird when it gets exposed. Like Jennifer Lawrence, when those naked pictures of her got exposed, like, I think, in some ways, people liked her more.They realized she’s just a person. It’s just a girl who likes sex, and is just alive, and has a boyfriend, and sends him messages. And now, you get to look into it, and you probably shouldn’t have, but somebody let it go, and they put it online, and all right."
    },
    {
      "role": "elon_musk",
      "text": "She seems to be doing okay."
    },
    {
      "role": "joe_rogan",
      "text": "She’s a person. She’s just you and me, and it’s the same thing. She’s just in some weird place where she’s on a 35-foot-tall screen with music playing every time she talks."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I mean, I’m sure she’s not happy about it, but she’s clearly doing fine."
    },
    {
      "role": "joe_rogan",
      "text": "But once this interface is fully realized where we really do become something far more powerful in terms of our cognitive ability, our ability to understand irrational thoughts and mitigate them, and that we’re all connected in some sort of an insane way. I mean, what would be our thoughts on wealth, our thoughts on social status? Like how many of those just evaporate? And our need for privacy, maybe our need for privacy, will be the ultimate bottleneck that we’ll have to surpass."
    },
    {
      "role": "elon_musk",
      "text": "I think the things that we think are important now will probably not be important in the future, but there will be things that are important. It’s just, like, different things."
    },
    {
      "role": "joe_rogan",
      "text": "What will be more important?"
    },
    {
      "role": "elon_musk",
      "text": "I don’t know. There might be some more ideas potentially. I don’t think Darwin’s going away.Darwin’s going to be there.Darwin will be there forever.It would just be a different arena."
    },
    {
      "role": "joe_rogan",
      "text": "A digital arena."
    },
    {
      "role": "elon_musk",
      "text": "Different arena. Darwin is not going away."
    },
    {
      "role": "joe_rogan",
      "text": "What keeps you up at night?"
    },
    {
      "role": "elon_musk",
      "text": "Well, it’s quite hard to run companies.Especially car companies, I would say. It’s quite challenging."
    },
    {
      "role": "joe_rogan",
      "text": "The car business is the hardest one of all the things you do?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Because it’s a consumer-oriented business as opposed to like SpaceX?"
    },
    {
      "role": "elon_musk",
      "text": "SpaceX is no walk in the park, but a car company, it’s very difficult to keep a car company alive. It’s very difficult. You know, there are only two car companies in the history of American car companies that haven’t gone bankrupt, and that’s Ford and Tesla. That’s it."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, Ford rode out that crazy storm, huh? They’re the only one."
    },
    {
      "role": "elon_musk",
      "text": "By the skin of their teeth."
    },
    {
      "role": "joe_rogan",
      "text": "Shout out to the Mustang.Yeah, by the skin of their teeth. That is interesting, right?"
    },
    {
      "role": "elon_musk",
      "text": "Same with Tesla, we barely survived."
    },
    {
      "role": "joe_rogan",
      "text": "How close did you get to folding?"
    },
    {
      "role": "elon_musk",
      "text": "Very close. I mean, 2008 is not a good time to be a car company, especially a startup car company, and especially an electric car company. That was like stupidity squared."
    },
    {
      "role": "joe_rogan",
      "text": "And this is when you had those cool Roadsters with the T-top?With a target top?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. We had like a — It was a highly modified Elise chassis. The body was all completely different. By the way, that was a super dumb strategy that we actually did because we-"
    },
    {
      "role": "joe_rogan",
      "text": "Why was it dumb?"
    },
    {
      "role": "elon_musk",
      "text": "It was based on two false premises. One false premise was that we would be able to cheaply convert the Lotus Elise and use that as a car platform, and that we’ll be able to use technology from this little company called AC Propulsion for the electric drive train and the battery.\nThe problem is, the AC propulsion technology did not work in production, and we ended up using none of it in the long-term. None of it. We had to resign everything.And then once you add a battery pack and electric motor to the car, it got heavier. It got 30% heavier. It invalidated the entire structure,  all the crash structure. Everything had to be redone. I think, less than 7% of the parts were common with any other device, including cars or anything."
    },
    {
      "role": "joe_rogan",
      "text": "7%?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Everything? Including tires, and wheels, bolts, brakes?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, even every-"
    },
    {
      "role": "joe_rogan",
      "text": "Steering wheel? Seat?"
    },
    {
      "role": "elon_musk",
      "text": "I think the steering wheel was almost the same. Yes, the windscreen."
    },
    {
      "role": "joe_rogan",
      "text": "Different?"
    },
    {
      "role": "elon_musk",
      "text": "No, the windscreen is the same. We were able to keep the windscreen."
    },
    {
      "role": "joe_rogan",
      "text": "Less than 7%. So, that’s basically-"
    },
    {
      "role": "elon_musk",
      "text": "Every body panel is different. The entire structure was different. We couldn’t use the HVAC system, the air conditioner. It was a belt-driven air conditioner. So, now, we needed something that was electrically driven. We need a new AC compressor."
    },
    {
      "role": "joe_rogan",
      "text": "And all that takes away from the battery life as well, right?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. We need a small, highly efficient air conditioning system that fits in a tiny car and was electrically powered, not belt-driven. It was very difficult."
    },
    {
      "role": "joe_rogan",
      "text": "How much of those weigh, those cars, the Roadster?"
    },
    {
      "role": "elon_musk",
      "text": "I think it was 2,700 pounds."
    },
    {
      "role": "joe_rogan",
      "text": "That’s still very light."
    },
    {
      "role": "elon_musk",
      "text": "2,700. Depending on which version, 2,650 to 2,750 pounds, something like that."
    },
    {
      "role": "joe_rogan",
      "text": "And what was the weight distribution?"
    },
    {
      "role": "elon_musk",
      "text": "It was about 50 — Well, there were different versions of the car. So, it’s about 55% on the rear."
    },
    {
      "role": "joe_rogan",
      "text": "That’s not bad."
    },
    {
      "role": "elon_musk",
      "text": "It was rear-biased."
    },
    {
      "role": "joe_rogan",
      "text": "Right, but not bad. Considering like a 911, which is like one of the most popular sports cars of all time. Heavy rear-end bias."
    },
    {
      "role": "elon_musk",
      "text": "Well, I mean, yeah. The 911, I’m not going to joke, is like the master despite Newton not being on their side. If you’re fighting Newton, it’s very difficult. The moments of inertia on a 911 don’t make any sense."
    },
    {
      "role": "joe_rogan",
      "text": "They do once you understand them. Once you understand-"
    },
    {
      "role": "elon_musk",
      "text": "You don’t want to hang the engine off the ass. This is not a wise move."
    },
    {
      "role": "joe_rogan",
      "text": "You don’t want to let up on the gas when you’re in a corner."
    },
    {
      "role": "elon_musk",
      "text": "The problem with something where the engine is mounted over the rear axle or off the rear axle towards the rear is that your polar moment of inertia is fundamentally screwed. You cannot solve this. It’s unsolvable. You’re screwed. Polar moment of inertia, you’re screwed essentially if you spawn the car like a top, that’s your polar moment of inertia. You’re just — I promised I wouldn’t swear on this show, by the way."
    },
    {
      "role": "joe_rogan",
      "text": "Really?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "To who?"
    },
    {
      "role": "elon_musk",
      "text": "This was for a friend."
    },
    {
      "role": "joe_rogan",
      "text": "Tell that friend to go fuck himself. Who told you not to swear?"
    },
    {
      "role": "elon_musk",
      "text": "A friend."
    },
    {
      "role": "joe_rogan",
      "text": "He’s not a good friend."
    },
    {
      "role": "elon_musk",
      "text": "I said I wouldn’t swear."
    },
    {
      "role": "joe_rogan",
      "text": "Realize you’re fucking Elon Musk. You can do whatever you want, man. If you ever get confused, call me."
    },
    {
      "role": "elon_musk",
      "text": "I’ll swear in private. Swear up a storm."
    },
    {
      "role": "joe_rogan",
      "text": "Okay, just say fricken. It’s a fun way. It’s like old house moms. Wives and shit that have children, „Oh, this fricken thing.“"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. But, anyway, it’s kind of incredible how well Porsche handles given that it’s the physics. The moments of inertia are so messed up. To actually still make it work well is incredible."
    },
    {
      "role": "joe_rogan",
      "text": "Well, if you know how to turn into the corner once you get used to the feeling of it, there are actual benefits to it. You know, there are some benefits."
    },
    {
      "role": "elon_musk",
      "text": "The car I had before Tesla was a 911."
    },
    {
      "role": "joe_rogan",
      "text": "997?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Great car, man."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I mean, particularly, the Porsche wouldn’t have the variable vanes on the turbo, and it didn’t have the turbo lag. That was great.That was really great. The turbo lag is, like, you know, you floor it, like phone home, call your mom."
    },
    {
      "role": "joe_rogan",
      "text": "The older one, right?"
    },
    {
      "role": "elon_musk",
      "text": "About an hour later, the car accelerates."
    },
    {
      "role": "joe_rogan",
      "text": "And super dangerous too because then the wheel will start spinning. There’s something fun about it, though, like feeling that rear weight kicking around, you know. And again-"
    },
    {
      "role": "elon_musk",
      "text": "No, it’s great."
    },
    {
      "role": "joe_rogan",
      "text": "… it’s not efficient."
    },
    {
      "role": "elon_musk",
      "text": "There’s a good feel to it."
    },
    {
      "role": "joe_rogan",
      "text": "But that’s what I was talking about earlier about that little car that I have, the ’93 911. It’s not fast. It’s not the best handling car, but it’s more satisfying than any other car I have because it’s so mechanical. It’s like everything about it, like crack holes and bumps, and it gives you all this feedback. And I take it to the\nComedy Store\nbecause when I get there, I feel like my brain is just popping, and it’s on fire. It’s like a strategy for me now that I really stop driving other cars there. I drive that car there just for the brain juice, just for the interaction."
    },
    {
      "role": "elon_musk",
      "text": "I mean, you should try Model S P100D."
    },
    {
      "role": "joe_rogan",
      "text": "I’ll try it."
    },
    {
      "role": "elon_musk",
      "text": "It will blow your mind and your skull."
    },
    {
      "role": "joe_rogan",
      "text": "Okay.\nTell me what to order, I’ll order it."
    },
    {
      "role": "elon_musk",
      "text": "Model S P100D."
    },
    {
      "role": "joe_rogan",
      "text": "Okay. Jamie, write it down."
    },
    {
      "role": "elon_musk",
      "text": "That’s the car that I drive."
    },
    {
      "role": "joe_rogan",
      "text": "Okay, I’ll get the car you drive."
    },
    {
      "role": "elon_musk",
      "text": "It will blow your mind out of your skull."
    },
    {
      "role": "joe_rogan",
      "text": "How far can I drive?"
    },
    {
      "role": "elon_musk",
      "text": "About 300 miles."
    },
    {
      "role": "joe_rogan",
      "text": "That’s good. For LA regular days, that’s good."
    },
    {
      "role": "elon_musk",
      "text": "You will never notice the battery."
    },
    {
      "role": "joe_rogan",
      "text": "Never?"
    },
    {
      "role": "elon_musk",
      "text": "Never."
    },
    {
      "role": "joe_rogan",
      "text": "How hard is it to get like one of them crazy plugs installed in your house? Is that difficult?"
    },
    {
      "role": "elon_musk",
      "text": "No, it’s super easy.It’s like a dryer plug. It’s like a dryer outlet."
    },
    {
      "role": "joe_rogan",
      "text": "Didn’t you come up with some crazy tiles for your roof that are solar paneled?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, I have it on my roof right now, actually. I’m just trying it out. The thing is, it takes a while to test roof stuff because roofs have to last a long time. So, like, you want your roof to last like 30 years."
    },
    {
      "role": "joe_rogan",
      "text": "Could you put it over a regular roof?"
    },
    {
      "role": "elon_musk",
      "text": "No. So, there are two versions. It’s like the solar panels you put on a roof. So, like, it depends on whether your roof’s new or old. So, if your roof’s new, you don’t want to replace the roof. You want to put solar panels on the roof.So, that’s like retrofit, you know. And they were trying to make the retrofit panels look real nice.\nBut then, the new product was coming out with it is if you have a roof that’s either you’re building a house, or you’re going to replace your roof anyway, then you make the tiles have solar cells embedded in the tiles.And then, it’s quite a tricky thing because you want to not see the solar cell behind the glass tile. So, you have to really work with the glass, and the various coatings, and the layers, so that you don’t see the solar cells behind the glass. Otherwise, it doesn’t look right.So, it’s really tricky."
    },
    {
      "role": "joe_rogan",
      "text": "There it is. Jaime put it up there.Man, that looks good."
    },
    {
      "role": "elon_musk",
      "text": "See, like, if you look closely, you can see. If you zoom in, like, you can see the cell. But if you zoom out, you don’t see the cell."
    },
    {
      "role": "joe_rogan",
      "text": "Right, but it looks cool though. Invisible solar cells."
    },
    {
      "role": "elon_musk",
      "text": "You see?Like that’s hard.It’s really hard because you have to get the sunlight to go through.But when it gets reflected back out, it hides the fact that there’s a cell there."
    },
    {
      "role": "joe_rogan",
      "text": "Now, are those available to the consumer right now?Those on that roof right there?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "That’s amazing. Oh, that looks good.Ooh, I like that."
    },
    {
      "role": "elon_musk",
      "text": "That one is hard."
    },
    {
      "role": "joe_rogan",
      "text": "Oh. So, you get that kind of fake Spanish-looking thing. I like that."
    },
    {
      "role": "elon_musk",
      "text": "That’s French slate."
    },
    {
      "role": "joe_rogan",
      "text": "That’s why people in Connecticut are smoking pipes. Look at that one."
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "That’s badass, dude. So, now-"
    },
    {
      "role": "elon_musk",
      "text": "Those all actually work."
    },
    {
      "role": "joe_rogan",
      "text": "I believe you. So, the solar panels that are on that house that we just looked at, is that sufficient to power the entire home?"
    },
    {
      "role": "elon_musk",
      "text": "It depends on your energy on how efficient-"
    },
    {
      "role": "joe_rogan",
      "text": "Expenditure?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah.\nSo, generally, yes. I would say it’s probably for most. It’s going to vary, but anywhere from more than you need to maybe half. Like, call it half to 1.5 of the energy that you need, depending on how much roof you have relative to living space."
    },
    {
      "role": "joe_rogan",
      "text": "And how ridiculous you are with your TV."
    },
    {
      "role": "elon_musk",
      "text": "TVs no problem. Air conditioning is the problem. If you have an efficient air conditioner, and you don’t — and depending on how — like, are you air conditioning rooms when they don’t need to be air-conditioned, which is very common because it’s a pain in the neck, you know. It’s like programming a VCR. It’s just a blinking 12:00. So, people are just like, „To the hell with that. I’m just going to make it this temperature all day long.“."
    },
    {
      "role": "joe_rogan",
      "text": "Right. They don’t have a smart home where if you’re in the room, then it stays cool, right?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, it should predict when you’re going to be home, and then cool the rooms that you’re likely to use with a little bit of intelligence. We’re not talking about like genius home here. We’re talking like elementary basic stuff. You know, like if you could hook that into the car, like manage you coming home. Like there’s no point keeping the home really cool when you’re not there.But it can tell that you’re coming home; it’s just going to cool it to the right temperature right when you get there."
    },
    {
      "role": "joe_rogan",
      "text": "Do you have an app that works with your solar panels or anything like that?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah, we do.But we need to hook it into the air conditioning to really make the air conditioning work."
    },
    {
      "role": "joe_rogan",
      "text": "Have you thought about creating an air conditioning system? I know you have. Trick question."
    },
    {
      "role": "elon_musk",
      "text": "Cannot answer questions about the future of potential products."
    },
    {
      "role": "joe_rogan",
      "text": "Okay. Let’s just let it go. We’ll move on to the next thing."
    },
    {
      "role": "elon_musk",
      "text": "That would be an interesting idea."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, I would say radiant heating and all that, good ideas. Now, when you think about the efficiency of these homes, and you think about implementing solar power and battery power, is there anything else that people are missing? Is there any other — Like, I just saw a smartwatch that is powered by the heat of the human body. It’s some new technology."
    },
    {
      "role": "elon_musk",
      "text": "It’s able to fully power that way?"
    },
    {
      "role": "joe_rogan",
      "text": "I don’t know if it’s fully or if it’s — Like this watch right here, this is a Casio.It’s called Pro Trek. And it’s like an outdoors watch, and it’s solar-powered. And so, it has the ability to operate for a certain amount of time on solar.So, if you have it exposed, it could function for a certain amount of time on solar."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Well, you know, like there are self-winding watches where, you know, it’s just got a weight in the watch. And as you move your wrist, the way it moves from one side to the other, and it winds the watch up. That’s a pretty cool thing."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah.\nWell, it’s amazing that like Rolex is that it’s all done mechanically.There are no batteries in there. There is no nothing."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. You could do the same thing. You create a little charger that’s based on wrist movement. It really depends on how much energy your watch uses."
    },
    {
      "role": "joe_rogan",
      "text": "You know what’s fucked up about that, though? We accept a certain amount of like fuckery with those watches. Like I brought my watch. I have a Rolex that my friend, Lorenzo, gave me, and I brought it to the watch store, and I said, „This thing’s always fast.“ I said, „It’s always like after a couple of months, it’s like five minutes fast.“ And they go, „Yup.“ They go, „Yeah.“"
    },
    {
      "role": "elon_musk",
      "text": "Really?"
    },
    {
      "role": "joe_rogan",
      "text": "„It’s just what it does.“"
    },
    {
      "role": "elon_musk",
      "text": "Okay."
    },
    {
      "role": "joe_rogan",
      "text": "I go, „Hold on.“ I go, „So, you’re telling me that it just is always going to be fast?“ They’re like, „Yeah. It’s just like every few months; you get like reset it.“"
    },
    {
      "role": "elon_musk",
      "text": "It seems like they should recalibrate that thing."
    },
    {
      "role": "joe_rogan",
      "text": "They can’t. They tried. They say, every few months, whether it’s four months, or five months, or six months, it’s going to be a couple of minutes fast."
    },
    {
      "role": "elon_musk",
      "text": "Okay. It seems like they should really recalibrate that because if it’s always fast, you can just, you know, delete those minutes."
    },
    {
      "role": "joe_rogan",
      "text": "You should figure that shit out. You need to fucking kick down the door at Rolex and go, „You bitches are lazy.“"
    },
    {
      "role": "elon_musk",
      "text": "It’s kind of amazing that you can keep time mechanically on a wristwatch with these tiny little gears."
    },
    {
      "role": "joe_rogan",
      "text": "It’s amazing. I mean, the whole luxury watch market is fascinating. I’m not that involved in terms like I don’t buy them. I’ve bought them as gifts. I don’t buy them for myself. But when I look at them online, there’s a million-dollar watches out there now that are like they have like little rotating moons and stars.Like, look at this thing, how much is that one, Jaime?"
    },
    {
      "role": "jaime",
      "text": "I don’t know. I just picked one."
    },
    {
      "role": "joe_rogan",
      "text": "These are fucking preposterous."
    },
    {
      "role": "elon_musk",
      "text": "I like gears."
    },
    {
      "role": "joe_rogan",
      "text": "I love them."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I think they are beautiful."
    },
    {
      "role": "joe_rogan",
      "text": "But there are some of these people that are just taking it right in the ass. They’re buying these watches for like $750,000. „Yeah, that’s a Timex, son.“ Nobody knows. It’s not any better than some Casio that you could just buy online.Well, here’s the thing. If you’re a person that doesn’t just want to know the time, you want craftsmanship, you want some artisan’s touch, you want innovation in terms of like a person figuring out how gears and cogs all line up perfectly, to every time it turns over, it’s basically a second.\nI mean, that’s just — There’s this art to that. It’s not just telling time. I like my watch a lot, but if it got hit by a rock, I wouldn’t be sad.It’s just to watch. It’s a mass-produced thing that runs on some quartz battery. But those things, there’s art to that."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. No, I agree. It’s beautiful. Love it."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. There’s something amazing about it. It’s because it represents the human creativity. It’s not just electronic innovation. There’s something. It’s a person’s work in that."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "You don’t have a watch on."
    },
    {
      "role": "elon_musk",
      "text": "No."
    },
    {
      "role": "joe_rogan",
      "text": "Ever?"
    },
    {
      "role": "elon_musk",
      "text": "I used to have a watch."
    },
    {
      "role": "joe_rogan",
      "text": "What happened?"
    },
    {
      "role": "elon_musk",
      "text": "My phone tells the time."
    },
    {
      "role": "joe_rogan",
      "text": "That’s a good point. Well, if you lose your phone? Do you — Wait, hold on.Let me guess; you are a no-case guy."
    },
    {
      "role": "elon_musk",
      "text": "That’s correct. Living on the edge. Living on the edge without a case."
    },
    {
      "role": "joe_rogan",
      "text": "Neil deGrasse Tyson. Neil deGrasse Tyson was in here last week. I’m marveled at his ability to get through life without a case."
    },
    {
      "role": "elon_musk",
      "text": "That’s right."
    },
    {
      "role": "joe_rogan",
      "text": "You know, he takes his phone, and he flips it in between his fingers like a soldier would do it with his rifle. He just rolls that shit in between his fingers. It’s marvelous. He says that’s the reason why they do it. He said, „Would you look at someone who has a rifle? Why would they do that? Why would they flip it around like that?“ It’s like, when it goes to drop, they have it in their hand. They catch it quickly.So, that’s what he does with his phone. He’s just flipping his phone around all the time.\n(\nJoe realizes that Elon examines something\n) I got that in Mexico. I was hoping it holds joints."
    },
    {
      "role": "elon_musk",
      "text": "Does it do anything? It tips to open."
    },
    {
      "role": "joe_rogan",
      "text": "No."
    },
    {
      "role": "elon_musk",
      "text": "Oh, it’s just a hole. You could store things in there."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. But like, try to put a joint in there. (\npasses him something\n) Close it. You put like one, one blunt. One, that seems pretentious. You know, that’s the idea behind it. I bought it when I was in Mexico because I figured it would be a good size to hold joints. (\ntakes a joint and lights it\n)"
    },
    {
      "role": "elon_musk",
      "text": "So, is that a joint? Or is it a cigar?"
    },
    {
      "role": "joe_rogan",
      "text": "No."
    },
    {
      "role": "elon_musk",
      "text": "Okay."
    },
    {
      "role": "joe_rogan",
      "text": "It’s marijuana inside of tobacco."
    },
    {
      "role": "elon_musk",
      "text": "Okay. So, it’s like posh, part tobacco and pot."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. You ever had that?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I think I tried one once."
    },
    {
      "role": "joe_rogan",
      "text": "Come on, man. You probably can’t because of stockholders, right?"
    },
    {
      "role": "elon_musk",
      "text": "I mean, it’s legal, right?"
    },
    {
      "role": "joe_rogan",
      "text": "Totally legal. (\npasses Elon the joint\n)"
    },
    {
      "role": "elon_musk",
      "text": "Okay."
    },
    {
      "role": "joe_rogan",
      "text": "How does that work? Do people get upset at you if you do certain things?\n(\nElon looks skeptically at the joint\n) It’s just tobacco and marijuana in there. (\nElon takes one puff of it and gives it back to Joe\n) That’s all it is. The combination of tobacco and marijuana is wonderful. First turned on to it by Charlie Murphy, and then reignited by Dave Chappelle. There you go. (\npasses the joint to Jaime\n)"
    },
    {
      "role": "jaime",
      "text": "Plus whiskey."
    },
    {
      "role": "elon_musk",
      "text": "Exactly."
    },
    {
      "role": "joe_rogan",
      "text": "Perfect. Balances it out."
    },
    {
      "role": "elon_musk",
      "text": "Alcohol is a drug that’s been grandfathered in."
    },
    {
      "role": "joe_rogan",
      "text": "Well, it’s not just a drug. It’s a drug that gets a bad rep because you just have a little, it’s great."
    },
    {
      "role": "elon_musk",
      "text": "Fine."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, a little sip here and there, and your inhibitions are relaxed, and it shows your true self. And, hopefully, you’re more joyous, and friendly, and happy, and everything’s good. The real worry is the people that can’t handle it. Like the real worry about people who can’t handle cars and go 0 to 60 in 1.9 seconds or anything. Have you ever considered something that — Like, imagine if one day, everyone has a car that’s on the same, at least, technological standard as one of your cars, and everyone agrees that the smart thing to do is not just to have bumpers but to perhaps have some sort of a magnetic repellent device, something, some electromagnetic field around the cars that as cars come close to each other, they automatically radically decelerate because of magnets or something."
    },
    {
      "role": "elon_musk",
      "text": "Well, I mean, our cars brake automatically."
    },
    {
      "role": "joe_rogan",
      "text": "Brake? When they see things?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "But like a physical barrier, like-"
    },
    {
      "role": "elon_musk",
      "text": "Well, the wheels work pretty well."
    },
    {
      "role": "joe_rogan",
      "text": "The wheels do."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, they work pretty well. Decelerated at, you know, 1.1 to 1.2 Gs, that kind of thing."
    },
    {
      "role": "joe_rogan",
      "text": "Is your concern that one day all your cars will be on the road, and then, there’ll still be regular people with regular cars 20-30 years from now that will get in the mix and be the main problem?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I think it’d be sort of like, you know, there was a time of transition where there were horses and gasoline cars on the road at the same time. It’s been pretty weird."
    },
    {
      "role": "joe_rogan",
      "text": "That would be the weirdest."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I mean, horses were tricky. You know, back when Manhattan had like 300.000 horses, then figure out like if a horse lives 15 years, you got 20,000 horses dropping dead every day or every year, I should say. Every year, it’s 20,000 horses if there are 300,000 horses in a 15-year lifespan."
    },
    {
      "role": "joe_rogan",
      "text": "Back in the\nGangs of New York\ndays, that movie."
    },
    {
      "role": "elon_musk",
      "text": "Yeah.It’s a lot of dead horses. You needed a horse to move the horse, and they’ll probably get pretty freaked out if they have to move a dead horse."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think they know what’s going on? Do you think it’s as hard?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah.I mean, it’s got to be pretty weird."
    },
    {
      "role": "joe_rogan",
      "text": "No, I would imagine."
    },
    {
      "role": "elon_musk",
      "text": "Like, in my mind, dragging this dead, you know, horse around, and I’m a horse.They might not like it."
    },
    {
      "role": "joe_rogan",
      "text": "Do you ever stop and think about your role in civilization? Do you ever stop and think about your role in the culture? Because me, as a person, who never met you until today, when I think of you, you know, I’ve always thought of you as being this weirdo super inventor dude who just somehow or another keeps coming up with new shit, but there’s not a lot of you out there. Like everybody else seems to be — I mean, obviously, you make a lot of money, and there’s a lot of people that make a lot of money.\n(Elon looks at something on the desk)\nYou like that clock?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Pretty dope, right?"
    },
    {
      "role": "elon_musk",
      "text": "This is a great clock."
    },
    {
      "role": "joe_rogan",
      "text": "You want one? I’ll get you one."
    },
    {
      "role": "elon_musk",
      "text": "Sure."
    },
    {
      "role": "joe_rogan",
      "text": "Okay, done."
    },
    {
      "role": "elon_musk",
      "text": "I like weird things like this."
    },
    {
      "role": "joe_rogan",
      "text": "Oh, this is the coolest. It’s TGT Promotion. What is this?\nTGT Studios\n?"
    },
    {
      "role": "jaime",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. So, a gentleman who makes all this by hand."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, it’s really cool. My study is filled with weird devices."
    },
    {
      "role": "joe_rogan",
      "text": "Well, get ready for another one."
    },
    {
      "role": "elon_musk",
      "text": "All right."
    },
    {
      "role": "joe_rogan",
      "text": "I’m sending it your way."
    },
    {
      "role": "elon_musk",
      "text": "Cool."
    },
    {
      "role": "joe_rogan",
      "text": "You want a werewolf too? I’ll hook you up."
    },
    {
      "role": "elon_musk",
      "text": "All right. I’ll take one."
    },
    {
      "role": "joe_rogan",
      "text": "Okay. One werewolf and one clock coming up.\nDo you think about your role in the culture? Because me, as a person, who never met you until today, I’ve always looked at you and like, „Wow.“ Like, „How does this guy just keep inventing shit?“ Like, how do you keep coming up with all these new devices? And do you ever consider how unusual — Like I had a dream once that there were a million Teslas. Instead of like one Tesla, there were a million Teslas. Not just say the car but Nikola."
    },
    {
      "role": "elon_musk",
      "text": "Oh, yeah, sure."
    },
    {
      "role": "joe_rogan",
      "text": "And that in his day,  there were a million people like him who were radically innovative.It was a weird dream, man. It was so strange. And I’ve had it more than once."
    },
    {
      "role": "elon_musk",
      "text": "That would result in a very rapid technology innovation. That’s for sure."
    },
    {
      "role": "joe_rogan",
      "text": "It’s one of the only dreams of my life I’ve had more than one time."
    },
    {
      "role": "elon_musk",
      "text": "Okay, wow."
    },
    {
      "role": "joe_rogan",
      "text": "Like where I’ve woken up, and it’s in the same dream. I’m in the same dream. And in this dream, it’s the 1940s, 1950s, but everyone is severely advanced. There are flying blimps with like LCD screens on the side of them. And everything is bizarre and strange. And it stuck with me for whatever — Obviously, this is just a stupid dream. But for whatever reason, all these years, that stuck with me like it takes one man, like Nikola Tesla, to have more than a hundred inventions that were patents, right. I mean, he had some pretty fucking amazing ideas. But there was-In his day, there were very few people like him."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, that was true."
    },
    {
      "role": "joe_rogan",
      "text": "What if there was a million? Like what in the experience-"
    },
    {
      "role": "elon_musk",
      "text": "Things would advance very quickly."
    },
    {
      "role": "joe_rogan",
      "text": "Right, but there’s not a million Elon Musks. There’s one motherfucker. Do you think about that, or you just try not to?"
    },
    {
      "role": "elon_musk",
      "text": "I don’t think you’d necessarily wanted to be me."
    },
    {
      "role": "joe_rogan",
      "text": "Well, what’s the worst part about you?"
    },
    {
      "role": "elon_musk",
      "text": "I never thought people would like it that much."
    },
    {
      "role": "joe_rogan",
      "text": "Well, most people wouldn’t, but they can’t be you. So, that’s like some superhero type shit. You know, we wouldn’t want to be Spiderman. I’d rather just sleep tight in Gotham City and hope he’s out there doing his job."
    },
    {
      "role": "elon_musk",
      "text": "It’s very hard to turn it off."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. What’s the hardest part?"
    },
    {
      "role": "elon_musk",
      "text": "It might sound great if it’s turned on, but what if it doesn’t turn off?"
    },
    {
      "role": "joe_rogan",
      "text": "Now, I showed you the\nisolation tank\n, and you’ve never experienced that before. I think that could help you turn it off a little bit just for the night."
    },
    {
      "role": "elon_musk",
      "text": "Okay."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. Just give you a little bit of sleep, a little bit of perspective. It’s magnesium that you get from the water as well that makes you sleep easier because the water has Epsom salts in it. But maybe some sort of strategy for sacrificing your — or not sacrificing but enhancing your biological recovery time by figuring out a way, whether it’s through meditation or some other ways to shut off that thing at night. Like you must have like a constant stream of ideas that’s running through your head all the time.\n(\nElon looks at his phone\n) You’re getting text messages from chicks."
    },
    {
      "role": "elon_musk",
      "text": "No. I’m getting text messages from a friend saying, „What the hell are you doing smoking weed?“."
    },
    {
      "role": "joe_rogan",
      "text": "Is that bad for you? It’s legal."
    },
    {
      "role": "jaime",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "It’s government-approved."
    },
    {
      "role": "elon_musk",
      "text": "It’s not — You know, I’m not a regular smoker of weed."
    },
    {
      "role": "joe_rogan",
      "text": "How often do you smoke it?"
    },
    {
      "role": "elon_musk",
      "text": "Almost never. I mean, it’s-"
    },
    {
      "role": "joe_rogan",
      "text": "How does it feel?"
    },
    {
      "role": "elon_musk",
      "text": "I don’t actually notice any effect."
    },
    {
      "role": "joe_rogan",
      "text": "Well, there you go. There was a time where – I think it was Ramdas or someone -gave some Buddhist monk a bunch of acid.And he ate it, and it had no effect on him."
    },
    {
      "role": "elon_musk",
      "text": "I doubt that."
    },
    {
      "role": "joe_rogan",
      "text": "I would say that too, but I’ve never meditated to the level that some of these people have where they’re constantly meditating all day. They don’t have any material possessions. And all of their energy is spent trying to achieve a certain mindset. I would like to cynically deny that. I’d like to cynically say, „Hey, just fuck and think the same way I do.“ They’re just hanging out with flip-flops on and make weird noises, but maybe no."
    },
    {
      "role": "elon_musk",
      "text": "You know, I know a lot of people like weed, and that’s fine, but I don’t find that it is very good for productivity."
    },
    {
      "role": "joe_rogan",
      "text": "For you."
    },
    {
      "role": "elon_musk",
      "text": "Not for me."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. I mean, I would imagine that for someone like you, it’s not. For someone like you, it would be more like a cup of coffee, right. You have a mate."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. It’s more like the opposite of a cup of coffee."
    },
    {
      "role": "joe_rogan",
      "text": "What is that?"
    },
    {
      "role": "elon_musk",
      "text": "It’s like a cup of coffee in reverse."
    },
    {
      "role": "joe_rogan",
      "text": "Weed is?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "No, I’m saying you would like more. More like will be beneficial to you. It would be like coffee."
    },
    {
      "role": "elon_musk",
      "text": "I like to get things done. I like to be useful. That is one of the hardest things to do is to be useful."
    },
    {
      "role": "joe_rogan",
      "text": "When you say you like to get things done, like, in terms of what gives you satisfaction? When you complete a project, when something that you invent comes to fruition, and you see people enjoying it, that feeling."
    },
    {
      "role": "elon_musk",
      "text": "Yes, doing something useful for other people that I like doing."
    },
    {
      "role": "joe_rogan",
      "text": "That’s interesting for other people."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think that that is maybe the way you recognize  that you have this unusual position in the culture where you can uniquely influence certain things because of this? I mean, you essentially have a gift, right.I mean, you would think it was a curse, but I’m sure it’s been fueled by many, many years of discipline and learning. But you, essentially, have a gift, and that you have this radical sort of creativity engine when it comes to innovation and technology. It’s like you’re just you’re going at very high RPMs."
    },
    {
      "role": "elon_musk",
      "text": "All the time. That doesn’t stop."
    },
    {
      "role": "joe_rogan",
      "text": "What is that like?"
    },
    {
      "role": "elon_musk",
      "text": "I don’t know what would happen if I got into a sensory deprivation tank."
    },
    {
      "role": "joe_rogan",
      "text": "Let’s try it."
    },
    {
      "role": "elon_musk",
      "text": "It sounds a little concerning."
    },
    {
      "role": "joe_rogan",
      "text": "But why?"
    },
    {
      "role": "elon_musk",
      "text": "It’s like running the engine with no resistance. That is-"
    },
    {
      "role": "joe_rogan",
      "text": "Is that what it is, though? Maybe it’s not."
    },
    {
      "role": "elon_musk",
      "text": "Maybe it’s fine. I don’t know.I’ll try it. I’ll try it. It’s fine."
    },
    {
      "role": "joe_rogan",
      "text": "Have you ever experimented with meditation or anything?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "What do you do, or what have you done rather?"
    },
    {
      "role": "elon_musk",
      "text": "I mean, just sort of sit there, and be quiet, and then repeat some mantra, which acts as a focal point. It does still the mind. It does still the mind, but I don’t find myself drawn to it frequently."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think that perhaps productivity is maybe more attractive to you than enlightenment or even the concept of whatever enlightenment means. Like, what are you trying to achieve when you’re meditating all the time? With you, it seems almost like there’s a franticness to your creativity that comes out of this burning furnace. And in order for you to calm that thing down, you might have to throw too much water on it."
    },
    {
      "role": "elon_musk",
      "text": "It’s like a never-ending explosion."
    },
    {
      "role": "joe_rogan",
      "text": "What is it like? Try to explain it to a dumb person like me. What’s going on?"
    },
    {
      "role": "elon_musk",
      "text": "Never-ending explosion."
    },
    {
      "role": "joe_rogan",
      "text": "It’s just constant ideas just bouncing around."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Damn.So, when everybody leaves, it’s just Elon sitting at home brushing his teeth, just a bunch of ideas bouncing around your head."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, all the time."
    },
    {
      "role": "joe_rogan",
      "text": "When did you realize that that’s not the case with most people?"
    },
    {
      "role": "elon_musk",
      "text": "I think, when I was, I don’t know, five or six or something. I thought I was insane."
    },
    {
      "role": "joe_rogan",
      "text": "Why did you think you were insane?"
    },
    {
      "role": "elon_musk",
      "text": "Because it is clear that other people do not. Their mind wasn’t exploding with ideas all the time."
    },
    {
      "role": "joe_rogan",
      "text": "So, they weren’t expressing it. They weren’t talking about it all day. And you realized by the time you were five or six like, „Oh, they’re probably not even getting this thing that I’m getting.“"
    },
    {
      "role": "elon_musk",
      "text": "No. It was just strange. It was like, „Hmm, kind of strange.“ That was my conclusion, kind of strange."
    },
    {
      "role": "joe_rogan",
      "text": "But did you feel diminished by it in any way? Like knowing that this is a weird thing that you really probably couldn’t commiserate with other people, they wouldn’t understand you."
    },
    {
      "role": "elon_musk",
      "text": "I hope they wouldn’t find out because they might like to put me away or something."
    },
    {
      "role": "joe_rogan",
      "text": "You thought that?"
    },
    {
      "role": "elon_musk",
      "text": "For a second, yes."
    },
    {
      "role": "joe_rogan",
      "text": "When you were little?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. They put people away. What if they put me away?"
    },
    {
      "role": "joe_rogan",
      "text": "Like when you were little, you thought this?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Wow. Well, you thought, „This is so radically different than the people that are around me. If they find out, I got this stream coming in.“"
    },
    {
      "role": "elon_musk",
      "text": "Yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Whoa."
    },
    {
      "role": "elon_musk",
      "text": "But, you know, I was only like five or six probably."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think this is like — I mean, there are outliers biologically. You mean, there are people that are 7 foot 9, there’s people that have giant hands, there’s people that have eyes that are 20/15 vision. There’s always outliers. Do you feel like you like caught this, like you have got some — you’re like on some weird innovation creativity sort of wave that’s very unusual? Like you tapped into — I mean, just think of the various things you’ve been able to accomplish in a very short amount of time, and you’re constantly doing this. That’s a weird — You’re a weird person, right."
    },
    {
      "role": "elon_musk",
      "text": "Right, I agree."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. Like, what if there’s a million Elon Musks?"
    },
    {
      "role": "elon_musk",
      "text": "Well, that would be very, very weird."
    },
    {
      "role": "joe_rogan",
      "text": "Whoa."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, it would be pretty weird. I agree. What if there were a million Joe Rogans?"
    },
    {
      "role": "joe_rogan",
      "text": "There probably is. There’s probably two million.  I mean, I think that’s the case with a lot of folks."
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I mean, but, like, you know, my goal is, like, try to do useful things, try to maximize the probability for the future’s good, make the future exciting, something you look forward to, you know. You know, with Tesla, I want to try to make things that people love. How many things can you buy that you really love, that really give you joy? So rare, so rare. I wish there were more things. That’s what we try to do. Just make things that somebody loves.That’s so difficult.\nJoe\nRogan\n:\nWhen you think about things that someone loves, like, do you specifically think about like what things would improve people’s experience, like what would change the way people interface with life that would make them more relaxed or more happy? You really think, like, when you’re thinking about things like that, is that like one of your considerations? Like what could I do that would help people that maybe they wouldn’t be able to figure out?"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. Like what are the set of things that can be done to make the future better? I think, a future where we are a space-faring civilization and out there among the stars, this is very exciting. This makes me look forward to the future. This makes me want that future. You know, the things, there need to be things that make you look forward to waking up in the morning. You wake up in the morning, you look forward to the day, you look forward to the future.\nAnd a future where we are a space-faring civilization and out there among the stars, I think, that’s very exciting. That is a thing we want; whereas, if we knew we would not be a space-faring civilization but forever confined to Earth, this would not be a good future. That would be very sad, I think. I don’t want a sad future."
    },
    {
      "role": "joe_rogan",
      "text": "It would be so sad in terms of just the finite lifespan of the Earth itself and the solar system itself. But even though it’s possibly — You know, I mean, how long do they feel like the sun and the solar system is going to exist? How many hundreds of millions of years?"
    },
    {
      "role": "elon_musk",
      "text": "Well, it’s probably, if you’re saying when does the sun boil the oceans-"
    },
    {
      "role": "joe_rogan",
      "text": "Right."
    },
    {
      "role": "elon_musk",
      "text": "About 500 million years."
    },
    {
      "role": "joe_rogan",
      "text": "So, is it sad that we never leave because, in 500 million years, that happens? Is that what you’re saying?"
    },
    {
      "role": "elon_musk",
      "text": "No. I just think like if there are two futures, and one future is we’re out there among the stars, and the things we read about and see in science fiction movies, the good ones, are true, and we have these starships, and we’re going see what other planets are like, and we’re a multi-planet species, and the scope and scale of consciousness is expanded across many civilizations, and many planets, and many star systems, this is a great future. This is a wonderful thing to me. And that’s what we should strive for."
    },
    {
      "role": "joe_rogan",
      "text": "But that’s biological travel. That’s cells traveling physically to another location."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Do you think that’s definitely where we’re going?"
    },
    {
      "role": "elon_musk",
      "text": "No."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, I don’t think so either. I used to think so. And, now, I’m thinking more likely less than ever. Like almost every day less likely."
    },
    {
      "role": "elon_musk",
      "text": "We can definitely go to the moon and Mars."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. Do you think we will colonize?"
    },
    {
      "role": "elon_musk",
      "text": "I think we will go to the asteroid belt. And we can go to the moons of Jupiter, Saturn, even get to Pluto."
    },
    {
      "role": "joe_rogan",
      "text": "That’d be the craziest place ever if we colonized Mars, and we terraformed it and turned it into a big Jamaica. Just oceans and-"
    },
    {
      "role": "elon_musk",
      "text": "I think we should. I think that would be great. That would be great. Amazing."
    },
    {
      "role": "joe_rogan",
      "text": "It’s possible, right?"
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "We can turn the whole thing into Cancún."
    },
    {
      "role": "elon_musk",
      "text": "Well-"
    },
    {
      "role": "joe_rogan",
      "text": "I mean, over time."
    },
    {
      "role": "elon_musk",
      "text": "It wouldn’t be easy but yes. You could warm it up."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, you can warm it up. You could add air. You get some water there. I mean, over time, hundreds of millions of years or whatever it takes."
    },
    {
      "role": "elon_musk",
      "text": "We’ll be a multi-planet species."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, that would be amazing."
    },
    {
      "role": "elon_musk",
      "text": "We’re a multi-planet species. That’s what we want to be. I’m pro-human."
    },
    {
      "role": "joe_rogan",
      "text": "Me too. Yeah, me too."
    },
    {
      "role": "elon_musk",
      "text": "I love humanity. I think it’s great."
    },
    {
      "role": "joe_rogan",
      "text": "We’re glad as a robot that you love humans because we love you too, and we don’t want you to kill us and eat us. And-"
    },
    {
      "role": "elon_musk",
      "text": "I mean, you know, strangely, I think a lot of people don’t like humanity and see it as a blight, but I do not."
    },
    {
      "role": "joe_rogan",
      "text": "Well, I think one of those — I think, part of that is just they’ve been — you know, they’ve been struggling. When people struggle, they associate their struggle  with other people. They never internalize their problems. They look to other people as holding them back, and people suck, and fuck people, and it’s just — You know, it’s a never-ending cycle. But not always. Again, most people are really good. Most people, the vast majority."
    },
    {
      "role": "elon_musk",
      "text": "This may sound corny."
    },
    {
      "role": "joe_rogan",
      "text": "It does sound corny."
    },
    {
      "role": "elon_musk",
      "text": "But love is the answer."
    },
    {
      "role": "joe_rogan",
      "text": "It is the answer."
    },
    {
      "role": "elon_musk",
      "text": "Yup."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, it is. It sounds corny because we’re all scared. You know, we’re all scared of trying to love people, being rejected, or someone taking advantage of you because you’re trying to be loving. What if we all could just relax and love each other?"
    },
    {
      "role": "elon_musk",
      "text": "It wouldn’t hurt to have more love in the world."
    },
    {
      "role": "joe_rogan",
      "text": "It definitely wouldn’t hurt."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, we should do that."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, I agree, man."
    },
    {
      "role": "elon_musk",
      "text": "Like really."
    },
    {
      "role": "joe_rogan",
      "text": "How are you going to fix that? Do you have a love machine you’re working on?"
    },
    {
      "role": "elon_musk",
      "text": "No, but probably spend more time with your friends and less time on social media."
    },
    {
      "role": "joe_rogan",
      "text": "Now, deleting social media from your applications, from your phones, will that give you a 10% boost to happiness? What do you think the percentage is?"
    },
    {
      "role": "elon_musk",
      "text": "I think probably something like that, yeah."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, a good 10%."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, I mean, the only thing I’ve kept is Twitter because I kind of like meet some means of getting a message out, you know.Well, that’s about it. So far, so good."
    },
    {
      "role": "joe_rogan",
      "text": "Well, what’s interesting with you, you actually occasionally engage with people on Twitter.What percentage of that is a good idea?"
    },
    {
      "role": "elon_musk",
      "text": "Good question."
    },
    {
      "role": "joe_rogan",
      "text": "Probably 10%, right? It’s hard."
    },
    {
      "role": "elon_musk",
      "text": "It’s mostly — I think, it’s on balance, more good than bad, but there’s definitely some bad. So, hopefully, the good outweighs the bad."
    },
    {
      "role": "joe_rogan",
      "text": "Do you ever think about how odd it is, the weird feeling that you get when someone says something shitty to you on Twitter, and you read it? That weird feeling. This weird little negative jolt. It’s like a subjective negative jolt of energy that you don’t really need to absorb, but you do anyway. Like, „I want to fuck this guy. Fuck him.“"
    },
    {
      "role": "elon_musk",
      "text": "I mean, there’s a lot of negativity on Twitter."
    },
    {
      "role": "joe_rogan",
      "text": "It is, but it’s weird in its form. Like the way, if you ingest it as if you’re like — you try to be like a little scientist as you’re ingesting it, you’re like, „How weird is this?“ And I’m even getting upset at some strange person saying something mean to me. It’s not even accurate."
    },
    {
      "role": "elon_musk",
      "text": "I mean, the vast number of negative comments, for the vast majority, I just ignore them, the vast majority.But every now and again, you get drawn in. It’s not good.You make mistakes."
    },
    {
      "role": "joe_rogan",
      "text": "Yes, you can make mistakes."
    },
    {
      "role": "elon_musk",
      "text": "We can make some mistakes."
    },
    {
      "role": "joe_rogan",
      "text": "We’re all human. We can make mistakes. Yeah, it’s hard. And people love it when you say something, and you take it back, and they’re like, „Fuck you. We saved it forever. I’ll fucking screenshot that shit, bitch. You had that thought. You had that thought.“ I’m like, „Well, I deleted it.“ „Not good enough. You had the thought. I’m better than you. I never had that thought. You had that thought, you piece of shit. Look, I saved it. I put it on my blog. Bad thought.“"
    },
    {
      "role": "elon_musk",
      "text": "Yeah. I’m not sure why people think that anyone would think that deleting a tweet makes them go away. It’s like, „Hello, been on the internet for a while.“ Anything is forever."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. Well, it’s even like, the thing is they don’t want you to be able to delete it because the problem is if you don’t delete it, and you don’t believe it anymore, it’s really hard to say, „Hey, that thing above, I don’t really believe that anymore. I changed the way I view things.“Because people would go, „Well, fuck you. I have that over there. I’m going to just take that. I’m not going to pay attention to that shit you wrote underneath it.“"
    },
    {
      "role": "elon_musk",
      "text": "It’s on your permanent record."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. It’s forever like a tattoo."
    },
    {
      "role": "elon_musk",
      "text": "Like high school, „We’ll put this on your permanent record.“"
    },
    {
      "role": "joe_rogan",
      "text": "Yeah. It’s like a tattoo. You keep it.\nWell, it’s this thing where there’s a lack of compassion. It’s a lack of compassion issue. People are just intentionally shitty to each other all the time online and trying to catch me. They’re more trying to catch people doing something that’s arrestable, like a cop trying to, like, get, you know, arrests on his record. It’s like they’re trying to catch you for something, more than they’re logically looking at it thinking it’s a bad thing that you’ve done, or that it’s an idea they don’t agree with so much, they needed to insult you. They’re trying to catch you."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, I mean, it’s way easier to be mean on social media than it is to be mean in person."
    },
    {
      "role": "joe_rogan",
      "text": "It’s weird. It’s not a normal way of human interacting.  It’s cheating. You’re not supposed to be able to interact so easily when people are not looking at you.You would never do that. You don’t be so mean when somebody is looking in their eyes. If you did, you’d feel like shit."
    },
    {
      "role": "elon_musk",
      "text": "Most people."
    },
    {
      "role": "joe_rogan",
      "text": "Yeah, unless you’re a sociopath, you’d feel terrible."
    },
    {
      "role": "elon_musk",
      "text": "Yes."
    },
    {
      "role": "joe_rogan",
      "text": "Elon Musk,\nthis has been a pleasure."
    },
    {
      "role": "elon_musk",
      "text": "Yeah, likewise."
    },
    {
      "role": "joe_rogan",
      "text": "It really has been."
    },
    {
      "role": "elon_musk",
      "text": "It’s been an honor. Thank you for having me."
    },
    {
      "role": "joe_rogan",
      "text": "Thanks for doing this because I know you don’t do a lot of long-form stuff like this. I hope I didn’t weird you out, and I hope you don’t get mad that you smoked weed.It’s not bad. It’s legal. We’re in California. This is just as legal as this whiskey we’ve been drinking."
    },
    {
      "role": "elon_musk",
      "text": "Exactly."
    },
    {
      "role": "joe_rogan",
      "text": "This is all good, right?"
    },
    {
      "role": "elon_musk",
      "text": "Cheers."
    },
    {
      "role": "joe_rogan",
      "text": "Cheers. Thank you. Is there any message you would like to put out other than love is the answer because I think you really nailed it with that?"
    },
    {
      "role": "elon_musk",
      "text": "No. I think, you know, I think people should be nicer to each other, and give more credit to others, and don’t assume that they’re mean until you know they’re actually mean. You know, just, it’s easy to demonize people. You’re usually wrong about it. People are nicer than you think. Give people more credit."
    },
    {
      "role": "joe_rogan",
      "text": "I couldn’t agree more. And I want to thank you not just for all the crazy innovations you’ve come up with and your constant flow of ideas but that you choose to spread that idea, which is very vulnerable, but it’s very honest, and it resonates with me.And I believe it."
    },
    {
      "role": "elon_musk",
      "text": "It’s true."
    },
    {
      "role": "joe_rogan",
      "text": "I believe it’s true too. So, thank you."
    },
    {
      "role": "elon_musk",
      "text": "You’re welcome."
    },
    {
      "role": "joe_rogan",
      "text": "All you assholes out there, be nice. Be nice, bitch. All right. Thank you, everybody. Thank you, Elon."
    },
    {
      "role": "elon_musk",
      "text": "All right, thank you."
    },
    {
      "role": "joe_rogan",
      "text": "Good night, everybody."
    }
  ]
}